[
{"post": ["I don't think this forum needs registration date elitism. People already have enough excuses to insult and fallaciously disregard other people's arguments. We don't need people to think that the points of idiots are more valid or truthful just because they've been her awhile and we don't need people to think that new people are idiots and their opinions shouldn't be acknowledged just because they're new.", "Jesus. This forum is scaring me. Usually, I'm the wackadoo on any particular forum, but lately I've been reluctant to post because I've been out-crazied. You know that you're insane when you see a hobo with crap-ridden pants backing away from you slowly.", "Also, anyone who is ragging about free speech and censorship needs to understand that those principles don't apply in internet forums any more than they apply to me if I take a sharpie to your apartment walls. Those are governmental concepts. This forum is not run by the government. You have no right to free speech here only so much as they can't censor based on a user's characteristic of being part of a special group (E.G., you can censor me for being gay if I'm posting about bitcoins within guidelines that apply to non-gays).", "This isn't even specifically about moderating offensiveness or spam, but relevance. Deleting someone's thread that says \"Sell sell sell\" is no different, in terms of free speech, from deleting a thread I might make featuring the entirety of the amino acid sequences for trypsin family proteases compared between various key animals so we might talk about concerted evolution with nary a mention of bitcoins."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Horkabork", "subject": "Re: Forum moderation policy", "message_number": "#21"},
{"post": ["1558678229"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678229", "subject": "1558678229", "message_number": "#2"},
{"post": ["1558678229"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678229", "subject": "1558678229", "message_number": "#2"},
{"post": ["1558678229"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678229", "subject": "1558678229", "message_number": "#2"},
{"post": ["1558678229"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678229", "subject": "1558678229", "message_number": "#2"},
{"post": ["I agree. I was just thinking it would have been handy for that time I gave away coins to newbies about a week ago and had to make sure people weren't suddenly signing up multiple times to the forum just to get in on the giveaway. I had to click through to each member's profile page to check."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Alex Beckenham", "subject": "Re: Forum moderation policy", "message_number": "#22"},
{"post": ["unemployed, part of free speech means you get to choose where to speak, meaning, somewhere else if you wish "], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "bitcoinminer", "subject": "Re: Forum moderation policy", "message_number": "#23"},
{"post": ["Same to you."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "unemployed", "subject": "Re: Forum moderation policy", "message_number": "#24"},
{"post": ["1. Free speech - you can say anything as long as it is relevant and presented in a calm and polite manner. Swearing, SHOUTING etc. make your post more likely to be removed.", "2. No zero value posts or threads, like \"SELL SELL SELL\"", "3. No pointless or uninteresting threads.", "4. No referral code spam", "5. No NSFW content", ". . . . . . . . . . . . . . . . . ", "These all sound reasonable to me, harmful but reasonable, number 1 is the most likely to be harmful to building the character of a robust community.", "I can see any number of posts that would be worthwhile and add to the character of this forum (to any forum) yet would fall foul of many of these caveats.", "For instance swearing is so culturally divisive that what might be seen as a genuine transgression by one person is simply humor (or more precisely 'humour') to another. From personal experience I know that - for example - Americans are can be offended by language that people from the UK are indifferent to, or even see as endearing, what to one person imbues a post with spirit and character to another renders it offensive.", "But of course nobody wants to have to 'listen' to someone hurling unnecessary and unwarranted abuse at another poster, so there is a real need to keep a check on this kind of thing, at least to some degree.", "I suggest you make a distinction between swearing per se and ad hominem, for example here are two examples . . .", ". . . example A contains swearing yet is (to these ears at least) not in the least bit offensive, example B is pure ad hominem, likely to elicit a similar response and is corrosive to the conversation.", "If on the other hand there is simply going to be a list of censored words then why not just use the BB software to track and change them, much like a US religious forum, so '", "' becomes '", "' - and 'no fucking way!' becomes 'no damn way'.", "Personally I think this kind of thing is a move in the wrong direction, I am a member of a cycling forum in the UK that has zero moderation and the tone and sense of community is something even the best drawn up list of rules could not come close to, the forum has grown from nothing to 50,000 + and suffers none of the problems lists of rules like these seek to address.", "It's fucking great !", " "], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "£", "subject": "Re: Forum moderation policy", "message_number": "#25"},
{"post": ["What happened to my thread \"how to send many emails\"? It was full of useful information related to bitcoin. Is this how free speech looks on this forum??"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "unemployed", "subject": "Re: Forum moderation policy", "message_number": "#26"},
{"post": ["Ask Horkabork:", "I agree forums (and servers) are private property and it's perfectly reasonable for the owners of such to impose whatever rules they feel like it. Then we as members are free to comply or simply leave."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Alex Beckenham", "subject": "Re: Forum moderation policy", "message_number": "#27"},
{"post": ["Okay…", "No \"moderators for life\".  Moderators -even the ones responsible for maintaining the site- are required step back and let the current \"Congress\" handle things.", "That way, we have citizen moderators.  Unlike cesspools like slashdot, becoming a moderator is not a lucky break that lasts for all of 5 minutes.  If someone is invited to be a moderator, they've already met certain thresholds and maybe placement on the OTC web of trust.", "This is a site about monetary philosophy, after all.  If you have no contribution to the economic activity of bitcoin, it might reveal a deficiency in the requirements of moderating for a few days. ", "You guys need the help and you cannot afford to either burnout or burnout random forum members. Use the spirit of volunteerism that is already here. ", "There should be a way for removed postings to be meta moderated.  A sort of appeal process.", "Anyway, that's my two bitcents. "], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "TradersEdgeDice", "subject": "Re: Forum moderation policy", "message_number": "#28"},
{"post": ["Well, the previous rules were nearly unlimited free speech. Things were put in FAQs like \"some users here have prickly shells, but we've grown to love them\". Now it changed overnight. Sure, everyone is free to leave this forum (and in effect leave bitcoin, because bitcoin is very linked to this forum). But it is unfair to mislead people so grossly. One day the biggest bitcoin forum is advertised as free speech, the next day there is no free speech.", "First the whole bitcoin is advertised as a libertarian currency in global media, then it quickly changes, because some early adopters from the United States want to safely cash out. If bitcoin is something different than everyone thinks, maybe you all should advertise it as another Facebook Credits or another World of Warcraft coins, or Second Life money, and stop misleading people and wasting people' time."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "unemployed", "subject": "Re: Forum moderation policy", "message_number": "#29"},
{"post": ["There is definately a lot of ranting going on that would not be suitable for work, which is being allowed. However, as long as it doesn't step into a degenerating personal abuse sphere, it's just silly and impracticible to moderate it constantly. The real danger is, as many have pointed out, nr 3 \"pointless or uninteresting threads\". No-one can impose their conception of pointless and uninteresting upon others; and if a thread is pointless and uninteresting it will quickly disappear, unless some \"pointless and uninteresting\" people continue such a debate. It would be much better to state clearly what kind of topics are off-limit (i.e. subjects that belong in other sub-forums) and allow a free debate as long as degenerating abuse is prohibited."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "dennis_sweden", "subject": "Re: Forum moderation policy", "message_number": "#30"},
{"post": ["I agree with everything you have said so far. \"useless\" posts would very much be decided based on opinion. If there is going to be moderation, I would say limit it to the MOVING of posts to off topic and what not. Perhaps even make a \"trash bin\" where all the sailor mouthed people can hang out and throw fecal matter at each other. Seeing as this is an international community and there is no way to satisfy everyones sense of morals due to differences in culture/religion/age/upbringing etc, my vote is that ALL posts may not be deleted and only moved. "], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Amechan", "subject": "Re: Forum moderation policy", "message_number": "#31"},
{"post": ["- - -"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "£", "subject": "Re: Forum moderation policy", "message_number": "#32"},
{"post": ["I have an uncomfortable feeling that's the entire point of this exercise, though :-(. We've already had one thread closed because ", ", where not valuable seems to mean posts questioning MagicalTux's story. Meanwhile other users have got away with tediously repetitive claims that the person whose 500,000-bitcoins were sold must've been plotting to undermine the market, copy-and-pasted multiple times in bright colours in the same thread.", "There's no constitutional requirement for free speech in forums, but the principles are still important in some form if you want a workable forum. While forum moderators may technically have the right to moderate arbitrarily, it's basically impossible to have a meaningful discussion or trust the forum threads to actually represent the opinions of the users in any way whatsoever if they abuse this. Worse still it's impossible to tell when they are abusing it as an outsider, so at the slightest whiff of dubious moderation you basically have to assume all discussions are tainted."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "makomk", "subject": "Re: Forum moderation policy", "message_number": "#33"},
{"post": ["The rumor is that the guys over at ", " agree to not censor/delete posts or lock conversations. That would be what free speech is. not this \"Say what we like and don't speak ill of our friends\" free speech crap."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "oneforall", "subject": "Re: Forum moderation policy", "message_number": "#34"},
{"post": ["I'm sure they would be happy to have all this gainful conversation."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "MoonShadow", "subject": "Re: Forum moderation policy", "message_number": "#35"},
{"post": ["The sole purpose of this forum is to further the Bitcoin agenda. Free speech has a lower priority so it should be ignored by moderators when it works against the primary goal."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "JohnDoe", "subject": "Re: Forum moderation policy", "message_number": "#36"},
{"post": ["I don't mind moderation, when done in, well, moderation. I do mind when I cant judge whether the mods are doing their jobs well or not. I can't judge for myself if I agree a thread was out of line if it's been deleted. ", "Mods, if you feel you need to shut a thread down, why not just lock it? Some other forums feature a \"trash bin\" section where \"deleted\" threads go, still available to read, but not cluttering the main forums. Maybe this would be something to look into here?", "Can anyone give a good reason why deleting a thread would be preferable to just locking it, absent legal reasons and other force majeure?"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "rebuilder", "subject": "Re: Forum moderation policy", "message_number": "#37"},
{"post": ["while i'm always pro transparency i see it's the right of the owners of this forum to delete as many posts as they want. you are free to leave. in fact i hope there will grow competition as with just one forum only, there is quite some power to manipulate the market by just randomly going offline."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "giszmo", "subject": "Re: Forum moderation policy", "message_number": "#38"},
{"post": ["Oddly those who are most vocal in their support for the new policy ('I support the new policy 100%.\") seem to be the ones most casually in breach of the new policy.", "Section one asks us to keep our posts calm and polite, but here we see people who are against these new rules labeled as 'ideologues' and dumped in the same bucket as 'trolls' and 'spammers' - and are invited to go elsewhere and swim in an ocean of shit.", "If you are in support of the new policy \"100%\" how do you square your use of 'shouting' (capitalized text) when it's clearly discouraged by the new policy ?", "To be honest I am not looking for an answer, my question is rhetorical, (it's not even aimed at you in particular), I am just making the point that even during the early birth pangs of this new policy those most supportive of it are already in breach of it.", "Add in a moderator (not now perhaps, but in 6 months or 2 years) who you end up in disagreement with and you, yourself, might find your posts deleted as you have already met the criteria."], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "£", "subject": "Re: Forum moderation policy", "message_number": "#39"},
{"post": ["I don't understand why this argument keeps coming up. Yes, of course it is their right to do what they please. I don't think wanton despotism is anyone's goal here, though. I'd like to discuss things instead of just having a hissy fit and leaving. Isn't that what forums are for - discussion?"], "page_number": 1, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "rebuilder", "subject": "Re: Forum moderation policy", "message_number": "#40"},
{"post": ["How is the value of a post evaluated? "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "maryjaysblog", "subject": "Re: Forum moderation policy", "message_number": "#681"},
{"post": ["1558678230"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["I'm not afraid of censorship, when done, well, censorship. I remember when I could not judge whether mods were doing their job well. I can not judge myself if I agree a topic is out of stock if it is deleted.", "Mods, if you feel you need to close a thread down, why not just lock it? Some other forums have a \"trash\" section where the \"deleted\" topic goes, is still available to read, but does not clutter the main forum. Perhaps this would be something to look at here?", "Can anyone give a good reason why deleting a topic would be more appropriate to just lock it, excuse absences and other unforeseen circumstances? ", " "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "cuongkenh22091996", "subject": "Re: Forum moderation policy", "message_number": "#682"},
{"post": ["If a thread is deleted, spammers hopefully cannot use it to claim rewards in signature and similar campaigns."], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "bitperson", "subject": "Re: Forum moderation policy", "message_number": "#683"},
{"post": ["I hope the forums are moderated a bit more carefully from now onwards. Spammers and those promoting some kind of ads should be banned absolutely."], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "edison benzamin", "subject": "Re: Forum moderation policy", "message_number": "#684"},
{"post": ["We are very careful about who we ban. You should be more careful about what posts you copy and paste:"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#685"},
{"post": ["It's very good that here so many ppl are involved in organazing everything according to rules. I'm a new here but I can say that mostly on forums moderators just simply blocked users or topics without any explanations. But here even one special topic is about policy.", "Of course each user should read rules and policy before posting smith but anyway in my opinion such kind of discussions are very useful especially for new members like me.", " ", "Thanks to all of u to explain everything properly "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "Korneev", "subject": "Re: Forum moderation policy", "message_number": "#686"},
{"post": ["This is all about ", ". If we want to have posts to qualify to a certain standard, ", ".", "So how we get those measures, who has them?", "The answer is: no one, because post's quality measures actually should be an ", " In respect of the forum posts, we need: ", "1) A standard of LOW-NORMAL-GOOD-EXCELLENT quality post.", "2)  How we define them (measures).  ", "If that quality standard for forum posts is described ", " in the ", ", everyone should be able to assess the quality/value of their posts.", "And if someone goes against the forum culture, moderators will stop them. ", "All in all, without ", " of ", " in forum posts, people continue to wonder, why their posts get removed sometimes."], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "jnns", "subject": "Re: Forum moderation policy", "message_number": "#687"},
{"post": ["Hi to everyone!!! there is any forum in spanish here?"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "Markitos32", "subject": "Re: Forum moderation policy", "message_number": "#688"},
{"post": ["Yes:"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#689"},
{"post": ["So far I have not violated any single rules and I have no complaints other than a problem with kwh. What I face after kwh can throw the fiat crazy because I do not agree with the existence of the false statement. "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "jhonnydeep87", "subject": "Re: Forum moderation policy", "message_number": "#690"},
{"post": ["I cant even figure out how to get my photo / avatar onto a page can someone email me a link?  "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "Halamaha", "subject": "Re: Forum moderation policy", "message_number": "#691"},
{"post": ["From ", ": "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "mprep", "subject": "Re: Forum moderation policy", "message_number": "#692"},
{"post": ["Can somebody help, how can i be part of the bitcoin talk forum"], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "hexonny", "subject": "question", "message_number": "#693"},
{"post": ["What do you mean by being part?", "As you have registered on bitcoin talk forum, you already are. If you want to be actively part of the forum, then just enter discussions writing helpful and interesting comments on threads you feel you have something valuable to share. ", "But before you start, please read the Beginners Help on Home section, and forum rules."], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "jnns", "subject": "Re: question", "message_number": "#694"},
{"post": ["You're already mate but if you're referring to signature campaign, bounties or any give participation, you have to wait till your account will be elevate to at least a Jr member but you need to make good post in other to achieve cause your account also need to be merited.", " ", "EDIT", "Read the below thread for more help.", " "], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "posi", "subject": "Re: question", "message_number": "#695"},
{"post": [], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "wesleyfrank", "subject": "Re: Forum moderation policy", "message_number": "#696"},
{"post": ["The first thing you need to do is stop using bold and colour in your posts like that or most people here will simply put you on their ignore list.", "Which board your posts belongs in depends on exactly it is you are trying to promote. The Bitcoin and Altcoin sections are separate so it needs to go in the correct one. What do you mean by 'platform'? Is it hardware or a service? If it is cloud mining then forget about promoting it all together.", "Your signature space is the only place you can put referral links. If you put them in your posts then your posts will get deleted."], "page_number": 2, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#697"},
{"post": ["There's already a last edit function (it appears if you edit your post after 10 minutes).", "As long as it's on your signature space, you can have it (using it in any other way is against the rules)."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#701"},
{"post": ["This is a welcome greetings to those who are new to this forum like me. I think this is a fabulous idea to encourage us how to write and share our thoughts. When members are willing to help us than junior like us feel homey and they also post correctly and everyone also see their thoughts. Thank you everyone."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "samiul12", "subject": "Re: Forum moderation policy", "message_number": "#698"},
{"post": ["not sure why my reply was deleted but its alright. I didn't mean to sound rude, go off topic or harm anyone. i apologize to the moderator "], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "kimaru", "subject": "Re: Forum moderation policy", "message_number": "#699"},
{"post": ["What is considered referral code spam? One of those full on advertising posts with referral codes all over it like were posted when tradehill opened? What if it's a little more subtle? What about low content posts with the code in the signature?"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.680", "author": "thiennhan677", "subject": "Re: Forum moderation policy", "message_number": "#700"},
{"post": ["1558678230"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["I am politely asking people for opinions and comments on my thread. I am not telling them to invest or buy my shares. ", "I think it is closer to a survey. If they do not like it they can write back to me directly. I do not use any bots or other automated systems."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "brengoskandel", "subject": "Re: Forum moderation policy", "message_number": "#702"},
{"post": ["I think most, if not all will be responsible. in addition, I just know one scenario reference code now and they don't even have to offer thanks to the competition them. most of the options bitcoin new (pool, Exchange, vendors, etc.). mostly found by posting here. reference code can be prohibited raw if people misuse in signatures,"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "Rakesh_alejandro", "subject": "Re: Forum moderation policy", "message_number": "#703"},
{"post": ["Please respect the moderators. I tried to click here to understand more on guidelines but couldn't see any detail here that would point to my post being taken down...can anyone chime in or help me out please?"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "badwin8883", "subject": "Re: Forum moderation policy", "message_number": "#704"},
{"post": ["Hi. in the claim reward form of a report send all retweet at once or each separately?"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "letanphuc142001", "subject": "Re: Forum moderation policy", "message_number": "#705"},
{"post": ["but if we join a signature campaign it's clear the rules, our post should be constructive and on the topic and spam is prohibited. I think if we actually read the rules we will not be careless to post, but everything goes back to the forum moderator policy. who can judge it just a forum moderator."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "forklif", "subject": "Re: Forum moderation policy", "message_number": "#706"},
{"post": ["I am a bit perplexed. I'm a new member, posted three times yesterday, and today I see that two of my posts are gone. ", "I can't even imagine a reason for this, I mean, like at all, given the posts. They were contributing to the discussion, the tone was amicable, offered some info, zero ads... ", "Any tips would be greatly appreciated. I certainly don't want to see my posts vanish and I'm eager to make change for the better, but I have no clue about what my offense was. "], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "dirac_pool", "subject": "Re: Forum moderation policy", "message_number": "#707"},
{"post": ["why your post was deleted, maybe the post you post is not constructive and does not match the topic discussed. now moderators have started with caution with our post, if they post spam, it will be deleted by moderator."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "berungan", "subject": "Re: Forum moderation policy", "message_number": "#708"},
{"post": ["On the one hand this is correct, but on the other ... Some people just created a new account, or incorrectly formulate their thoughts"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "Brenok", "subject": "Re: Forum moderation policy", "message_number": "#709"},
{"post": ["I think At least there should be something in the user account that says eg \"No spam!\" or other warnings. I know how sensitive this issue is and I will not overwhelm this forum with spam because it will have a negative impact on me and my business. I am just trying to find balance.", "If I send PM manually and each is unique in the sense that the message is addressed to a specific person and says there is content related to this person's activity or interest, it should not be treated as spam. Feedback is generally positive and some people log onto our platform. This means that my information has value to them. I am not asking to join the platform but for opinions on business models, websites etc. So as long as no one complained and reported me it was Ok."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "Telogodok", "subject": "Re: Forum moderation policy", "message_number": "#710"},
{"post": ["Yesterday four my posts were deleted  "], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "HelenS", "subject": "Re: Forum moderation policy", "message_number": "#711"},
{"post": ["where I can learn the rules of this forum?"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "wayne nani", "subject": "Re: Forum moderation policy", "message_number": "#712"},
{"post": ["Many of my posts have been deleted too for reasons I can't even begin to understand. The problem is the \"uninteresting\" part. So you could be talking about your idea for a mining company or a coin and if a moderator feels that to him/her it is uninteresting they'll delete it. Or if someone asks a question such as, \"Where do you guys see bitcoin heading in the next 6 months?\" If you give your opinion to that and a mod disagrees (making it uninteresting to them) they'll delete it. Many will say that's abuse of power but it's a private forum, their house, and they can block you or delete you for any reason."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "IntraCoin", "subject": "Re: Forum moderation policy", "message_number": "#713"},
{"post": ["Can anyone tell me why I'm still a newbie?"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "KryptoKnight78", "subject": "Re: Forum moderation policy", "message_number": "#714"},
{"post": ["Because you don't have enough posts or activity yet: "], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#715"},
{"post": ["Also, I would like to ask if I am a newbie in bitcoin spectrum and I have stupid questions. Can I still ask? "], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "harshalone", "subject": "Re: Forum moderation policy", "message_number": "#716"},
{"post": ["Where can be found the rules about posting in this forum?"], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "annajt19", "subject": "Re: Forum moderation policy", "message_number": "#717"},
{"post": ["I guess what I'm trying to ask is, is there any reason not to just completely prohibit referral code? They are mostly spam and not really beneficial to the forum. And then it will be a clear line of execution.", "Spammers and promoters of some types of advertising should be banned altogether."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "nakamita", "subject": "Re: Forum moderation policy", "message_number": "#718"},
{"post": ["There is this development I beginning to notice in this our beloved platform,so many restrictions and most times are so so annoying the other time I replied a post to a brother constructive post and after which the account got blocked that made me feel so bad because I have had that account for so long,an account I created way back so months early last year it was a painful experience because I never expected it to happen that way."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "Roerk5", "subject": "Re: Forum moderation policy", "message_number": "#719"},
{"post": ["Okay, I know I'm a newbie here in these forums but that's okay. My first question and perhaps it is a stupid one...what exactly does \"NSFW content\" mean? Thanks."], "page_number": 3, "url": "https://bitcointalk.org/index.php?topic=20333.700", "author": "Viendong6158", "subject": "Re: Forum moderation policy", "message_number": "#720"},
{"post": ["I don't think this forum needs registration date elitism. People already have enough excuses to insult and fallaciously disregard other people's arguments. We don't need people to think that the points of idiots are more valid or truthful just because they've been her awhile and we don't need people to think that new people are idiots and their opinions shouldn't be acknowledged just because they're new.", "Jesus. This forum is scaring me. Usually, I'm the wackadoo on any particular forum, but lately I've been reluctant to post because I've been out-crazied. You know that you're insane when you see a hobo with crap-ridden pants backing away from you slowly.", "Also, anyone who is ragging about free speech and censorship needs to understand that those principles don't apply in internet forums any more than they apply to me if I take a sharpie to your apartment walls. Those are governmental concepts. This forum is not run by the government. You have no right to free speech here only so much as they can't censor based on a user's characteristic of being part of a special group (E.G., you can censor me for being gay if I'm posting about bitcoins within guidelines that apply to non-gays).", "This isn't even specifically about moderating offensiveness or spam, but relevance. Deleting someone's thread that says \"Sell sell sell\" is no different, in terms of free speech, from deleting a thread I might make featuring the entirety of the amino acid sequences for trypsin family proteases compared between various key animals so we might talk about concerted evolution with nary a mention of bitcoins."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Horkabork", "subject": "Re: Forum moderation policy", "message_number": "#21"},
{"post": ["1558678230"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["I agree. I was just thinking it would have been handy for that time I gave away coins to newbies about a week ago and had to make sure people weren't suddenly signing up multiple times to the forum just to get in on the giveaway. I had to click through to each member's profile page to check."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Alex Beckenham", "subject": "Re: Forum moderation policy", "message_number": "#22"},
{"post": ["unemployed, part of free speech means you get to choose where to speak, meaning, somewhere else if you wish "], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "bitcoinminer", "subject": "Re: Forum moderation policy", "message_number": "#23"},
{"post": ["Same to you."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "unemployed", "subject": "Re: Forum moderation policy", "message_number": "#24"},
{"post": ["1. Free speech - you can say anything as long as it is relevant and presented in a calm and polite manner. Swearing, SHOUTING etc. make your post more likely to be removed.", "2. No zero value posts or threads, like \"SELL SELL SELL\"", "3. No pointless or uninteresting threads.", "4. No referral code spam", "5. No NSFW content", ". . . . . . . . . . . . . . . . . ", "These all sound reasonable to me, harmful but reasonable, number 1 is the most likely to be harmful to building the character of a robust community.", "I can see any number of posts that would be worthwhile and add to the character of this forum (to any forum) yet would fall foul of many of these caveats.", "For instance swearing is so culturally divisive that what might be seen as a genuine transgression by one person is simply humor (or more precisely 'humour') to another. From personal experience I know that - for example - Americans are can be offended by language that people from the UK are indifferent to, or even see as endearing, what to one person imbues a post with spirit and character to another renders it offensive.", "But of course nobody wants to have to 'listen' to someone hurling unnecessary and unwarranted abuse at another poster, so there is a real need to keep a check on this kind of thing, at least to some degree.", "I suggest you make a distinction between swearing per se and ad hominem, for example here are two examples . . .", ". . . example A contains swearing yet is (to these ears at least) not in the least bit offensive, example B is pure ad hominem, likely to elicit a similar response and is corrosive to the conversation.", "If on the other hand there is simply going to be a list of censored words then why not just use the BB software to track and change them, much like a US religious forum, so '", "' becomes '", "' - and 'no fucking way!' becomes 'no damn way'.", "Personally I think this kind of thing is a move in the wrong direction, I am a member of a cycling forum in the UK that has zero moderation and the tone and sense of community is something even the best drawn up list of rules could not come close to, the forum has grown from nothing to 50,000 + and suffers none of the problems lists of rules like these seek to address.", "It's fucking great !", " "], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "£", "subject": "Re: Forum moderation policy", "message_number": "#25"},
{"post": ["What happened to my thread \"how to send many emails\"? It was full of useful information related to bitcoin. Is this how free speech looks on this forum??"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "unemployed", "subject": "Re: Forum moderation policy", "message_number": "#26"},
{"post": ["Ask Horkabork:", "I agree forums (and servers) are private property and it's perfectly reasonable for the owners of such to impose whatever rules they feel like it. Then we as members are free to comply or simply leave."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Alex Beckenham", "subject": "Re: Forum moderation policy", "message_number": "#27"},
{"post": ["Okay…", "No \"moderators for life\".  Moderators -even the ones responsible for maintaining the site- are required step back and let the current \"Congress\" handle things.", "That way, we have citizen moderators.  Unlike cesspools like slashdot, becoming a moderator is not a lucky break that lasts for all of 5 minutes.  If someone is invited to be a moderator, they've already met certain thresholds and maybe placement on the OTC web of trust.", "This is a site about monetary philosophy, after all.  If you have no contribution to the economic activity of bitcoin, it might reveal a deficiency in the requirements of moderating for a few days. ", "You guys need the help and you cannot afford to either burnout or burnout random forum members. Use the spirit of volunteerism that is already here. ", "There should be a way for removed postings to be meta moderated.  A sort of appeal process.", "Anyway, that's my two bitcents. "], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "TradersEdgeDice", "subject": "Re: Forum moderation policy", "message_number": "#28"},
{"post": ["Well, the previous rules were nearly unlimited free speech. Things were put in FAQs like \"some users here have prickly shells, but we've grown to love them\". Now it changed overnight. Sure, everyone is free to leave this forum (and in effect leave bitcoin, because bitcoin is very linked to this forum). But it is unfair to mislead people so grossly. One day the biggest bitcoin forum is advertised as free speech, the next day there is no free speech.", "First the whole bitcoin is advertised as a libertarian currency in global media, then it quickly changes, because some early adopters from the United States want to safely cash out. If bitcoin is something different than everyone thinks, maybe you all should advertise it as another Facebook Credits or another World of Warcraft coins, or Second Life money, and stop misleading people and wasting people' time."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "unemployed", "subject": "Re: Forum moderation policy", "message_number": "#29"},
{"post": ["There is definately a lot of ranting going on that would not be suitable for work, which is being allowed. However, as long as it doesn't step into a degenerating personal abuse sphere, it's just silly and impracticible to moderate it constantly. The real danger is, as many have pointed out, nr 3 \"pointless or uninteresting threads\". No-one can impose their conception of pointless and uninteresting upon others; and if a thread is pointless and uninteresting it will quickly disappear, unless some \"pointless and uninteresting\" people continue such a debate. It would be much better to state clearly what kind of topics are off-limit (i.e. subjects that belong in other sub-forums) and allow a free debate as long as degenerating abuse is prohibited."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "dennis_sweden", "subject": "Re: Forum moderation policy", "message_number": "#30"},
{"post": ["I agree with everything you have said so far. \"useless\" posts would very much be decided based on opinion. If there is going to be moderation, I would say limit it to the MOVING of posts to off topic and what not. Perhaps even make a \"trash bin\" where all the sailor mouthed people can hang out and throw fecal matter at each other. Seeing as this is an international community and there is no way to satisfy everyones sense of morals due to differences in culture/religion/age/upbringing etc, my vote is that ALL posts may not be deleted and only moved. "], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "Amechan", "subject": "Re: Forum moderation policy", "message_number": "#31"},
{"post": ["- - -"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "£", "subject": "Re: Forum moderation policy", "message_number": "#32"},
{"post": ["I have an uncomfortable feeling that's the entire point of this exercise, though :-(. We've already had one thread closed because ", ", where not valuable seems to mean posts questioning MagicalTux's story. Meanwhile other users have got away with tediously repetitive claims that the person whose 500,000-bitcoins were sold must've been plotting to undermine the market, copy-and-pasted multiple times in bright colours in the same thread.", "There's no constitutional requirement for free speech in forums, but the principles are still important in some form if you want a workable forum. While forum moderators may technically have the right to moderate arbitrarily, it's basically impossible to have a meaningful discussion or trust the forum threads to actually represent the opinions of the users in any way whatsoever if they abuse this. Worse still it's impossible to tell when they are abusing it as an outsider, so at the slightest whiff of dubious moderation you basically have to assume all discussions are tainted."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "makomk", "subject": "Re: Forum moderation policy", "message_number": "#33"},
{"post": ["The rumor is that the guys over at ", " agree to not censor/delete posts or lock conversations. That would be what free speech is. not this \"Say what we like and don't speak ill of our friends\" free speech crap."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "oneforall", "subject": "Re: Forum moderation policy", "message_number": "#34"},
{"post": ["I'm sure they would be happy to have all this gainful conversation."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "MoonShadow", "subject": "Re: Forum moderation policy", "message_number": "#35"},
{"post": ["The sole purpose of this forum is to further the Bitcoin agenda. Free speech has a lower priority so it should be ignored by moderators when it works against the primary goal."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "JohnDoe", "subject": "Re: Forum moderation policy", "message_number": "#36"},
{"post": ["I don't mind moderation, when done in, well, moderation. I do mind when I cant judge whether the mods are doing their jobs well or not. I can't judge for myself if I agree a thread was out of line if it's been deleted. ", "Mods, if you feel you need to shut a thread down, why not just lock it? Some other forums feature a \"trash bin\" section where \"deleted\" threads go, still available to read, but not cluttering the main forums. Maybe this would be something to look into here?", "Can anyone give a good reason why deleting a thread would be preferable to just locking it, absent legal reasons and other force majeure?"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "rebuilder", "subject": "Re: Forum moderation policy", "message_number": "#37"},
{"post": ["while i'm always pro transparency i see it's the right of the owners of this forum to delete as many posts as they want. you are free to leave. in fact i hope there will grow competition as with just one forum only, there is quite some power to manipulate the market by just randomly going offline."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "giszmo", "subject": "Re: Forum moderation policy", "message_number": "#38"},
{"post": ["Oddly those who are most vocal in their support for the new policy ('I support the new policy 100%.\") seem to be the ones most casually in breach of the new policy.", "Section one asks us to keep our posts calm and polite, but here we see people who are against these new rules labeled as 'ideologues' and dumped in the same bucket as 'trolls' and 'spammers' - and are invited to go elsewhere and swim in an ocean of shit.", "If you are in support of the new policy \"100%\" how do you square your use of 'shouting' (capitalized text) when it's clearly discouraged by the new policy ?", "To be honest I am not looking for an answer, my question is rhetorical, (it's not even aimed at you in particular), I am just making the point that even during the early birth pangs of this new policy those most supportive of it are already in breach of it.", "Add in a moderator (not now perhaps, but in 6 months or 2 years) who you end up in disagreement with and you, yourself, might find your posts deleted as you have already met the criteria."], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "£", "subject": "Re: Forum moderation policy", "message_number": "#39"},
{"post": ["I don't understand why this argument keeps coming up. Yes, of course it is their right to do what they please. I don't think wanton despotism is anyone's goal here, though. I'd like to discuss things instead of just having a hissy fit and leaving. Isn't that what forums are for - discussion?"], "page_number": 4, "url": "https://bitcointalk.org/index.php?topic=20333.20", "author": "rebuilder", "subject": "Re: Forum moderation policy", "message_number": "#40"},
{"post": ["I start feeling uneasy. A couple of weeks ago I posted here wondering why the thread I begun was deleted, as well as another post elsewhere. And today I find that the same happened with another thread I started yesterday. ", "Do you want the details? The first thread of some weeks ago was about how the Korean government started using blockchain for their own purposes. I was deeply baffled when I saw it deleted, while value-less new comments about e.g. Satoshi's identity stay. ", "An acquaintance explained to me that it was probably because I mentioned governments. ", "If this was the reason, then this sounds to me as if a forum for atheists should not mention the topic \"god\". ", "Even more disappointing, another message I wrote on that same day disappeared and I can't imagine why. (Can I guess that the mod who did't like my thread also deleted the message as extra punishment?) ", "And today? I started a thread discussing the new Metronome coin and its unusual sale strategy. I even got replies. What was my sin here? Is a decreasing price sale more meaningless than the n-th post about how great or horrible BTC is without any argument, or often without any grammatical structure? Was my sin the fact that I mention I'll buy some Metronome? ", "Earnest replies appreciated. I'm a noob on the forum trying to discuss what I deem to be serious questions and points, because this is how I view this whole story. I have some respect for what is going on here, so I'm baffled by my posts seemingly being considered pointless and insulting, while I'm kept in the dark as to why this is so. "], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "dirac_pool", "subject": "Re: Forum moderation policy", "message_number": "#721"},
{"post": ["1558678230"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["This is a bitcion forum. If it was a thread merely about blockchain tech used by the Korean government in Bitcoin Discussion then that's probably why it was trashed. Unless it's related to bitcoin then it'll be trashed or moved into the appropriate sub.", "Did you post it in Bitcoin Discussion? If so, then discussion about alt coins doesn't belong there. Threads containing ref links or just 'buy this coin' threads are also trashed. "], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#722"},
{"post": ["I agree with most of what @unemployed has mentioned, which is also repeated in numerous other posts in this thread, on the principle of terms being vague or non-specific and solely subject to individual interpretation. Words like \"pointless\" or especially \"uninteresting\" are completely subjective and therefore subject to any particular moderators personal feelings, mood, or selective scrutiny.", "Also some rule categories are mixed within the same numbered points for example:", "1. Free speech - you can say anything as long as it is...  ", "  ", "2. No zero value posts or threads", " ", " ", "4. No referral code", " ", "; ", " ", "=========== Partial Proposed Revisions ===========", "I'm not going to propose a rewrite for each of these 1-5, but just add on here for clarity. I believe my post makes the intended point about being more succinct in the rulemaking, not lengthier but specific.", "1. Free ", "peech - ", "2. No zero value posts or threads", "  ", "  ", "   ", "4. ", " ", "5.", " ", " "], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "chipr", "subject": "Re: Forum moderation policy", "message_number": "#723"},
{"post": ["if I present it in a calm and polite manner..think of it like this you have freedom of speech in the presence of your mother, but would you choose your words more carefully...now that we have thousands of posts every day we can't afford of them..."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "daddypastes", "subject": "Re: Forum moderation policy", "message_number": "#724"},
{"post": ["Sometimes I wonder why my messages are being deleted, reason why I stopped posting. But I am now guided of what to be posted. Hope moderator will be easy on our postings"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "ay0d1", "subject": "Re: Forum moderation policy", "message_number": "#725"},
{"post": ["Go to the Home on your BCT account there you will see the Bitcoin Forum Tab.", "Then scroll down and click on the Topic \"Other\" there you can find the sub subject \"Beginner & Help\" now click on it and then again scroll down and click on \"Newbies-Read before posting\" here you can read the rules of Bitcoin Forum."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "Gaurav111kb", "subject": "Re: Forum moderation policy", "message_number": "#726"},
{"post": ["Most times o make a post and it is deleted without any explanation as to why it was deleted. Can someone tell me why posts get deleted when it's not abusive, shout, spam or links?"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "Jimmygentle", "subject": "Re: Forum moderation policy", "message_number": "#727"},
{"post": [" I commend the moderators for being very active, but I'll be guided as to why posts are just deleted outrightly, it will help"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "Jimmygentle", "subject": "Re: Forum moderation policy", "message_number": "#728"},
{"post": ["To do so is reasonable. a way to fit the system. Participants will limit the spam, the content does not mean"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "cuongdola211091", "subject": "Re: Forum moderation policy", "message_number": "#729"},
{"post": ["Most likely, it had to do with other rules (what you're seeing on this thread, it's just a few rules [refer to: ", "]).", "- Also there's this:"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#730"},
{"post": ["A small selection from your posts which have escaped deletion.", "These are referred to as shit posts or spam, they add no value to the discussion and are routinely deleted by moderators under official anti spam policy.", "Post when you have something of interest to say, not just for the sake of increasing your post count, probably to get some sats/exposure for your signature (which doesn't work).", "Shape up or ship out. (google it)"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "tmfp", "subject": "Re: Forum moderation policy", "message_number": "#731"},
{"post": ["what are the things should i know or learn about this forum ? Someonee help me  ", " ", " "], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "sagittarius1", "subject": "Re: Forum moderation policy", "message_number": "#732"},
{"post": ["Read.", "And don't post rubbish."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "tmfp", "subject": "Re: Forum moderation policy", "message_number": "#733"},
{"post": ["Hello there guys, how can I earn a merit? cause I don't have one. And they said that you need it for you to rank up? is that right?"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "bitkid015", "subject": "Re: Forum moderation policy", "message_number": "#734"},
{"post": ["You earn merits by posting helpful information. That is correct you need some merits for the next rank. You can read more about it ", ".", "Edit : If you still have some questions start a thread on ", "."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "ralle14", "subject": "Re: Forum moderation policy", "message_number": "#735"},
{"post": ["How does one determine low value of a post?"], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "Caitlin", "subject": "Re: Forum moderation policy", "message_number": "#736"},
{"post": ["Either ways you can edit your post after it is being posted on a thread. So i don't think that should be the focus on this forum. How about implementing Vote pools, or Add job option to the Home forums. I know I the place can be vandalized but with strict forum moderator the place can turn out good. Because there are so many job opportunities in cryptocurrency. Without a special thread for it, posting job opportunities around other threads will still be regarded spam. I stand to be corrected though. Just adding up...  "], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "Lion_ashy", "subject": "Re: Forum moderation policy", "message_number": "#737"},
{"post": ["I really think post are regularized or categorized by moderators rather than calling it crap or low value post easily. And I it is a great help for newbies and let them give a boost of motivation."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "earvin01", "subject": "Re: Forum moderation policy", "message_number": "#738"},
{"post": ["In most cases, it's quite obvious [1] but in some cases, it's subjective [23]:", "[1]:", "[23]:", "We already have such board: \"", "\"", "It won't happen (not feasible - Requires way more manpower and it's really unnecessary [IMO])."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#739"},
{"post": ["Its hard to move on if you not knowing what happening about spam. now is the time to make changes to the beginner of this bitcoin rules we need to reading searching wisely."], "page_number": 5, "url": "https://bitcointalk.org/index.php?topic=20333.720", "author": "Quoctuan", "subject": "Re: Forum moderation policy", "message_number": "#740"},
{"post": ["For in-depth explanations, refer to \"", "\".", "Exactly, so it's subjective:"], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#761"},
{"post": ["1558678230"], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["Determining the quality of the post depends on the readers perception. ", "As long as you are not posting off topic in the discussion and you don't do redundant and repetitive post. There are long posts but has content of repetition, there are short posts that contains exact answer. If the question is answerable by yes or no, don't make it long unless you are defending or describing something."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "batang_bitcoin", "subject": "Re: Forum moderation policy", "message_number": "#762"},
{"post": ["Even for sure many newcomers are not interested in the rules, they are just trying to earn a rating ..."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "gooddly", "subject": "Re: Forum moderation policy", "message_number": "#763"},
{"post": ["Or copy and pastes, which is what that post is:"], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#764"},
{"post": ["The rules still apply whether your project is 'really promising' or not. What exactly are you not not ok with here? You want to be able to shout and swear about it or what?"], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#765"},
{"post": ["Forum moderation policy is a useful guide for us to have the right knowledge and maintain the standards in this forum. I always read here in this forum for me to educate myself with the help of the quality posts that written by the high ranking members. So let us make an effort to learn how to get merit and let us just be obedient enough to imply the basic rules of this forum. It will be great and productive if all of us here will do and obey the simple rules."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "doodle07", "subject": "Re: Forum moderation policy", "message_number": "#766"},
{"post": ["Let me agree with you completely.", "But .!", "I added that we must be positive partners", "We convey to the administration other views so that their vision can be broadened .", "Some members are upset by some administration policies", "But they do not care to Delivery their point of view", "Our mission is the link to make matters clearer."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "rab2005", "subject": "Re: Forum moderation policy", "message_number": "#767"},
{"post": ["yeah", "Strong project and strong views Always accompanied by a quiet tone of voice", "Wisdom says", "( Actions speak louder than words )  "], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "rab2005", "subject": "Re: Forum moderation policy", "message_number": "#768"},
{"post": ["Do you offer chances to newbies who may not know the rules as there is a lot to read through, or do you go for an instant ban?"], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "pagettsgadgets", "subject": "Re: Forum moderation policy", "message_number": "#769"},
{"post": ["Bitcoin policy is quite easy to abide on. But sometimes I really don't get it why my post will be deleting each passing day."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "Fmradio98", "subject": "Re: Forum moderation policy", "message_number": "#770"},
{"post": ["Yes, big percentage of valuable information couldn't be found because of all the junk."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "project_delta", "subject": "Re: Forum moderation policy", "message_number": "#771"},
{"post": ["100% agree, but there should be a decent mechanism to differentiate between genuine user & the spammer. Not every newbie is banned or restricted from the community unless he is competent enough to do something better for the community."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "SamB24", "subject": "Re: Forum moderation policy", "message_number": "#772"},
{"post": ["Hi, ", "There's something wrong with my account. The signature I've been wearing was taken off and my rank goes back to a newbie. I was already a JR. Member and the posts and activity are still good. Nothing has changed. I guess some are also experiencing this problem. Could you help us please about this concern? ", "Thank you."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "Yramesor0", "subject": "Re: Forum moderation policy", "message_number": "#773"},
{"post": ["100% agree, but there should be a decent mechanism to differentiate between genuine user & the spammer.", "Bitcoin policy is quite easy to abide on. But sometimes I really don't get it why my post will be deleting each passing day."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "Bhagchand bana", "subject": "Re: Forum moderation policy", "message_number": "#774"},
{"post": ["I'm going to speak my peace on this issue and if I get banned or Neg Trust so be it ", "I joined bitcointalk to learn about Bitcoin mining  I still want to get into Bitcoin mining ", "Lurked a bit then posted as a newbie asking questions about mining . my post were deleted . ", "Started reading about altcoins and got into Twitter Bounties with the idea of making enough ", "coin to get my first rig. ", "Before this change you ranked up to Jr pretty quick  I think it was 45 activity  I'm at 238 activity now and ", "NEVER did a signature bounty, and they pay much more then twitter bounties. ", "WHY?  . because of the way I was treated asking questions in the bitcoin mining forums when I started ", "I never considered going back, so when the ranks of everyone without merit was changed to newbie, ", "it means nothing to me. ", "Now I understand that the \"elders\" of bitcointalk want to stop \"spam\" messages of signature campaigns from ", "flooding your threads But when you do these blanket actions that effect members that had nothing to do with this signature ", "spamming it only confirms the decisions of a lot of members like me to ignore the forums totally and focus on the bounties .", "I will give credit to the bitcoin talk members that are fighting against scam ICO's.  ", "I do go to the scam accusation thread  daily to make sure I dont promote scam ICO's.  The one time I was tagged with Neg ", "Trust  for promoting a scam ICO I read the  rules made the required changes and the neg trust was removed.   ", "I understand your need to stop \"spammers\" but there has to be a better way. Bitcointalk has to become ", "more welcoming to people that REALLY want to learn about and get involved with Bitcoin and crypto.  ", "Mass adaption of crypto will require it .. ", "If this is my last post before being banned it's ok I spoke my mind. "], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "icomasterether", "subject": "Re: Forum moderation policy", "message_number": "#775"},
{"post": ["Read: ", "Did it follow the rules of that section: ", "It used to be at 30th activity.", "One of the reasons is direct & long-lasting exposure within the crypto community (I'd rather not get into details in regards to other reasons since this isn't the appropriate place for that)...", "Those that have nothing to do with \"spam issues\", won't/shouldn't be affected in anyway (I'm amazed at the frequency of users complaining for a single merit, in such a short time)...", "Any suggestions?", "There's a big difference between what you just said and what most users (spammers) do (don't mix it up)."], "page_number": 6, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#776"},
{"post": ["Is this the reason why some threads for some new coins were deleted."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "debtfree", "subject": "Re: Forum moderation policy", "message_number": "#781"},
{"post": ["What do you mean about NSFW content? i don't understand it, i hope there are some poeple who will help me to make things clear about it. These rules and policy will help us to maintain the cleanliness of the Bitcoin."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "shainasaz", "subject": "Re: Forum moderation policy", "message_number": "#777"},
{"post": ["Suggestions:  ", "#1 . Ban signature campaigns - this solves the spamming threads problem.  ", "#2. Force all new ICO's into a approval process run by the same bitcointalk members that now inspect and expose fake icos after they post. This will save the bitcointalk members plenty of time chasing down scam icos and hitting newbies with neg trust for promoting scam icos.  ", "#3 Charge icos a small fee for the approval process to be given to the bitcoin talk members that spend time doing the inspection.", "#4. After these things are completed, become more welcoming to newbies that just want to learn more about bitcoin and crypto."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "icomasterether", "subject": "Re: Forum moderation policy", "message_number": "#778"},
{"post": ["many of them spam you see on Aurum coin someone post already different what topic is. So what i do is report to moderator as he post not relevant.", "GUYS who now member need clean this like \"shitpost\"", "we eager to do blacklist who already spammed post on many tread 1 to said \"scam thing\" and he drove away to thread he like....", "this trick old days make pain. hope moderator and administrator used lock by system for who \"kid\" and who already \"mature\" for this. as developer coins. im pissed of this kid doing not just on aurum post but anything place like on bitcoin and bitcoin cash said ", "\"wow this like good ico\"", "more strict on them please staff", "good bless and good day for us and owner + staff forum", "that i just wanna said. well many case but i cannot post here many too long!", "ah can we have lock who spam. i mean them cannot send message to us. they need password to to that. so i not tired for remove spammer. thank you"], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "nur1labs", "subject": "Re: Forum moderation policy", "message_number": "#779"},
{"post": [" One of those full on advertising posts with referral codes all over it like were posted when tradehill opened? ", "What if it's a little more subtle? ", "What about low content posts with the code in the signature?", "I guess what I'm trying to ask is, is there any reason to not just fully ban referral codes? ", "They're mostly just spam and don't really benefit the forum any. And then it'd be a clear enforceable line."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.760", "author": "Mansoor_Official", "subject": "Re: Forum moderation policy", "message_number": "#780"},
{"post": ["1558678230"], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["i wanna administrator here strict. cuz many post by newbie unrelevant and they keep spam. moderator here like silent. consider spam. double post.", "why double post bad?!cuz the flood database with same username is bad...THERE button EDIT!why them not used EDIT! "], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "nur1labs", "subject": "Re: Forum moderation policy", "message_number": "#782"},
{"post": ["they not just that. they keep spamming by double post. i wanna moderator put no double post......WHAT for button \"EDIT\" i ask you?this not facebook or twitter always free doung by spam flood. i wanna admin here more strict like on my game forum. it's more strict there!"], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "nur1labs", "subject": "Re: Forum moderation policy", "message_number": "#783"},
{"post": ["I checked \"", "\" but there wasn't any (for the past 30 days).", "- If you didn't receive any notifications:", "- You'll receive a notification:", "Yes (", " > ", ").", "- Take note of the following line:"], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#784"},
{"post": ["Going through your post history, its either bounty whoring or one liner shit post. So don't be surprised by mods deleting your post. As per ", ", 6 of your post were deleted.", "Follow @SFR10 advised below and get a copper membership."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "Kemarit", "subject": "Re: Forum moderation policy", "message_number": "#785"},
{"post": ["The use of self moderation combined with bumping accounts is spreading on the forum, see the ", " for a prime example.", "I have been reporting them but moderator response seems to be uncertain, my last report of ~100 posts remains unhandled and the pages continue to fill up with garbage conversations. ", "The fact that that particular thread is also a proven scam means that threads on the forum that use these bumping services, especially when combined with self moderation, will continue to expand in number and subvert the whole concept of \"forum\" by turning it into an uncontrolled spammer/scammer notice board.", "Ignoring them is not the answer, please have a convo at policy level on this subject, there are a few of us that would help if asked."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "tmfp", "subject": "Re: Forum moderation policy", "message_number": "#786"},
{"post": ["Once the moderation is consistent, there should be less upheaval. When moderation seems to be selective the masses uproar and cry injustice."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "X7", "subject": "Re: Forum moderation policy", "message_number": "#787"},
{"post": ["Don't like it either.  Deleting what you don't like doesn't make it useless. Readers are in best position to judge this not moderators. It could be 'interesting' and of 'high value' to readers but yet deleted. Question is: what happens when an interesting post is deleted? "], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "olohifie", "subject": "Re: Forum moderation policy", "message_number": "#788"},
{"post": ["dear moderator, i am a new bee member on this forum, i am trying to get my self accostomed to the forum policy, so i dont violate anyrules in the long run. please i dont know if this type of question is acceptable here, my appologies if its not. the question is,", "is there a way we can detect averts that are scam, or better still projects that are scam, so we dont end up violating the rules, because in my own humble opinion some project are scam even at ICO stage and innocent  people working for those project might end up violating the rules by posting for them. how do you tackle such problem?"], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "lajutex", "subject": "Re: Forum moderation policy", "message_number": "#789"},
{"post": ["I think this is a very good idea. Use the fee to pay people to inspect the ICO. At the same time hundreds of trusted members would gladly do this work. Is there a downside?"], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "goldkingcoiner", "subject": "Re: Forum moderation policy", "message_number": "#790"},
{"post": ["Actually, it is really hard to pinpoint if a project is heading to be a scam at its early stage.", "One way to check possible scam in the making is to visit the section- Scam Accusations Board (", ")", "Also, there are red flags that you can check - fake profiles, plagiarized papers, free website domains, and many more.", "And if you found out that a particular project has unresolved issues or open scam allegations and you still continue to promote it, then, that's the time that someone might give you negative feedback."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "TimeTeller", "subject": "Re: Forum moderation policy", "message_number": "#791"},
{"post": ["Re: Forum moderation policy:", "At this moment two of the last 5 posts are copy/paste garbage, the same content from two different noobs."], "page_number": 7, "url": "https://bitcointalk.org/index.php?topic=20333.780", "author": "Bit_Happy", "subject": "Re: Forum moderation policy", "message_number": "#792"},
{"post": ["How difficult would it be to implement a voting system for posts using the current forum software?"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "polladwills", "subject": "Re: Forum moderation policy", "message_number": "#741"},
{"post": ["1558678230"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["Some 'vain' topics are actually quite interesting, if not educational. I agree with the introductory code, though it is interesting to see, some people are quite creative. One of the full advertising posts with the referral code on it all as it was posted when the tradehill opened? What about low content posts with code in the signature? They are mostly spam and not really beneficial to the forum."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "dalvitka", "subject": "Re: Forum moderation policy", "message_number": "#742"},
{"post": ["About the moderation policy how could someone commit a red trust violation, what is possible to do to aware this violation and about the merit system how can we avail it in order to rank up our stage."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "Ianbadz2000", "subject": "Re: Forum moderation policy", "message_number": "#743"},
{"post": ["Sometimes you had to be watchful by your posts, do not try to copy paste from others post in order you to have a good post but it not comes from you, the highness of this forum will sentence you what is right to do the forum moderation policy will apply the the unrighteous post you made.."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "coinxwife", "subject": "Re: Forum moderation policy", "message_number": "#744"},
{"post": ["Forum moderation and trust feedback are completely separate systems. ", "Trust feedback is left by members based on their view or experience of dealing with other members and is not moderated by the forum admin.", "Merits are awarded based on the quality of your posts. There are merit sources who actively look for good posts as well as other members showing their approval by awarding them."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "tmfp", "subject": "Re: Forum moderation policy", "message_number": "#745"},
{"post": ["There are some get mad by getting red trust to their account what is the real basis of their fault, some are protesting is their a way to erase the red trust they got? "], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "coinxwife", "subject": "Re: Forum moderation policy", "message_number": "#746"},
{"post": ["Trust is unmoderated so nothing to do with this thread. The only way to remove red trust is for the person who left it to delete it. That means they must resolve the issue with the person involved directly."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#747"},
{"post": ["Is there any possible way to un-ban profile?"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "Komal sharma", "subject": "Re: Forum moderation policy", "message_number": "#748"},
{"post": ["Not when you get caught for copy and pasting:"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#749"},
{"post": ["Limited Liberty is ok. Too much of Liberty is dangerous as it may affect the interests of other members. Anything may be stated as long as the interests of a majority of members are not affected."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "sudnokpok", "subject": "Re: Forum moderation policy", "message_number": "#750"},
{"post": ["Don't post. Read and learn. Then post."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "tmfp", "subject": "Re: Forum moderation policy", "message_number": "#751"},
{"post": ["Just asking simple questions probably won't get you banned but copying and pasting someone else's post (like you did here) could get you banned. "], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "crypt0j0e", "subject": "Re: Forum moderation policy", "message_number": "#752"},
{"post": ["The moderators are experts and i believe they know what post have low value,uninteresting and pointless so is a step in good direction."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "cryptodaddy981", "subject": "Re: Forum moderation policy", "message_number": "#753"},
{"post": ["Great ! I love this .  Though I am a fresh here."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "tony-huang", "subject": "Re: Forum moderation policy", "message_number": "#754"},
{"post": ["It is a very good idea though to have moderation in this forum since it will help ensure some level of politeness across all posts. My only worry is it may become subjective and the moderators will determine which post should stay or be removed."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "Priestly131", "subject": "Re: Forum moderation policy", "message_number": "#755"},
{"post": ["If the topic was deleted, the number of posts in it meant it was deleted and the number of activities decreased ?"], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "hacsoi2799", "subject": "Re: Forum moderation policy", "message_number": "#756"},
{"post": ["Yes. Your activity would only decrease if that was the only post you made in an activity period. Please read this: "], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#757"},
{"post": ["Forum moderation policy is much needed in this activity like your post is unrelevant and nonsense the highness of this forum will made their actions against you they might give you a red trust sanction or else they deleted your post so be sure of your posting.."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "Leanna44", "subject": "Re: Forum moderation policy", "message_number": "#758"},
{"post": ["lurker "], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "deitraagentu0", "subject": "Re: Forum moderation policy", "message_number": "#759"},
{"post": ["Agreed. Also, a voting system should help."], "page_number": 8, "url": "https://bitcointalk.org/index.php?topic=20333.740", "author": "Atomz", "subject": "Re: Forum moderation policy", "message_number": "#760"},
{"post": ["See what I mean:", " "], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#661"},
{"post": ["1558678230"], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["1558678230"], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "1558678230", "subject": "1558678230", "message_number": "#2"},
{"post": ["That is hilarious! (and co.)", "I want to try my hand at making a honeypot thread too."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "xhomerx10", "subject": "Re: Forum moderation policy", "message_number": "#662"},
{"post": ["banned account ", ". Sorry Koluchka, you are banned from posting or sending personal messages on this forum.", "You have been banned by a forum moderator. You may appeal here: ", "Can I do something to unlock this account?"], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Psyxoz", "subject": "Re: Forum moderation policy", "message_number": "#663"},
{"post": ["No, because you were copy and pasting content. "], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#664"},
{"post": ["can for the first time a warning. I did not know that I violated the rules."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Psyxoz", "subject": "Re: Forum moderation policy", "message_number": "#665"},
{"post": ["You should have read the rules but you should know that plagiarism isn't acceptable."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#666"},
{"post": ["I'm new here. Now I know but I can not use my account. you could have given a warning. but I was given a ban. I think this is not normal. It could be banned for several days, but here forever."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Psyxoz", "subject": "Re: Forum moderation policy", "message_number": "#667"},
{"post": ["Why should we give warnings to people who can't read rules? Copy and pasting = a permanent ban. Everybody knows plagiarising is unacceptable and there's no excuses for it."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#668"},
{"post": ["This is a great new implementation by bitcoin organisation to implement this new rule. There is just too much cyber junk floating around in bitcoin. Now at least the bad posters will have a reason to stop."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "byhunter37", "subject": "Re: Forum moderation policy", "message_number": "#669"},
{"post": ["What if you qoute it last week then the followed week you qoute it again without any intention, what is the sunction of it..."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Leenkoranan", "subject": "Re: Forum moderation policy", "message_number": "#670"},
{"post": ["The good of this forum is you learned something and you improved your speech in english, but you must aware of guidelines of this forum.."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "princess22", "subject": "Re: Forum moderation policy", "message_number": "#671"},
{"post": ["We all know that this forum gives us excitement day by day by making our post apprechable, but think twice your post.."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "RolandoBTC", "subject": "Re: Forum moderation policy", "message_number": "#672"},
{"post": ["hey some thread start as a silly questions  for newbie and jr members ( like me )  and its ok because  higher rank member  will in most of the time answer them in just the first page and max  2nd / 3rd page  but what is nonsense and unacceptable is that some of those topic become the shit posters  favorite place  with more than 50 or 100 page   ( how ik ?  because i posted on them and even after few days i just keep seeing them on my watch list  and it become annoying   )   so  why people dont lock those huge post  ?  also can we report them to moderators so they lock them  ?  and what should we say as description "], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "iillaa", "subject": "Re: Forum moderation policy", "message_number": "#673"},
{"post": ["Strangely, I personally did not face moderation, apparently I did not leave any controversial reports. And all my friends did not have a negative experience of moderation."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Markmolotok1488", "subject": "Re: Forum moderation policy", "message_number": "#674"},
{"post": ["Well the whole post would make sense if you just remove that phrase altogether and not try to give fake \"free speech\":", "1. You can say anything as long as it is relevant and presented in a calm and polite manner. Swearing, SHOUTING etc. make your post more likely to be removed.", "2. No zero value posts or threads, like \"SELL SELL SELL\"", "3. No pointless or uninteresting threads.", "4. No referral code spam", "5. No NSFW content"], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "starskylarkm9", "subject": "Re: Forum moderation policy", "message_number": "#675"},
{"post": ["We all know why so much spam. Answer: subscription companies. When a person has an assignment to write 10 to 15 messages a week, he does not think much about the value of the message. No subscriptions = no spam."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "nerlial", "subject": "Re: Forum moderation policy", "message_number": "#676"},
{"post": ["Why some posts are deleted, even they show the emotions about the problem of some discussion? "], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Kristy22", "subject": "Re: Forum moderation policy", "message_number": "#677"},
{"post": ["I am politely asking people for opinions and comments on my thread. I am not telling them to invest or buy my shares. I think it is closer to a survey. If they do not like it they can write back to me directly. I do not use any bots or other automated systems."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "Benedict Lee", "subject": "Re: Forum moderation policy", "message_number": "#678"},
{"post": ["I wonder what is the definition of low value. Value is relative. to one person it might be of high value and relevant while to another it might be of no value."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "tarolina vida", "subject": "Re: Forum moderation policy", "message_number": "#679"},
{"post": ["I very well could have, but since I just joined the forum...I wanted to make my first post. Had to do it sometime so why not ask a stupid question. It seems others do it. Also, others ask nonstupid questions that a google search will provide answers for."], "page_number": 9, "url": "https://bitcointalk.org/index.php?topic=20333.660", "author": "alazne lily", "subject": "Re: Forum moderation policy", "message_number": "#680"},
{"post": ["I have to say that i was like that in the beginning trying to move up my rank. Making short low quality posts. Nowadays i tried to be more informed and bring some value to this forum. i still have the problem of the poor grammer but thats something that i´m trying to improve also. in "], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "cripto_fc", "subject": "Re: Forum moderation policy", "message_number": "#581"},
{"post": ["1558678231"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["Hi", "How can I contact the admin(s) of the forum? ", "I have 2 old accounts and wonder if I can unite them... or whatever is best todo. ", "I cannot enter into one of them so I need help of admin but dont see any way to ", "contact him/her/them "], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "capitalaccent", "subject": "Re: Forum moderation policy", "message_number": "#582"},
{"post": ["The two administrators are ", " and ", ". You can contact them via PM. They are very busy and may not view this request as a priority so you may wait some time for a response."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#583"},
{"post": ["I want to familiarize and understand every policy in this bitcoin forum.Pls one one who can advice me what should I do so that I can avoid violation?"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "icons6", "subject": "Re: Forum moderation policy", "message_number": "#584"},
{"post": ["Other than the above listed on the first page. It is important to make this forum sustain its quality and cleanliness.", "1. No to shitposting it means that do not post just to increase your post count. Making unsubstantial post, poor English or not readable by everyone.", "2. Scamming people", "3. Posting another reply in ", " ", "4. Buying or selling BCT Accounts.", " your post quality. Do not just post because of payment. POST because you want to be useful in this community."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "Maus0728", "subject": "Re: Forum moderation policy", "message_number": "#585"},
{"post": ["You just need a little bit of your time reading this ", " ", "Everything that you need to avoid is already there, 32 forum rules to be specific and some additional and helpful guidelines below.", "These are the very few but major concerns in the forum but 1 and 3 can be consolidated into one."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "jossiel", "subject": "Re: Forum moderation policy", "message_number": "#586"},
{"post": ["Doesn't have to be here for a long time to know about it"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "Jeremycoin", "subject": "Re: Forum moderation policy", "message_number": "#587"},
{"post": ["Which kind of posts mark as spam? please share and refer me. I want to know more clearly about spam on this forum."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "R21", "subject": "Re: Forum moderation policy", "message_number": "#588"},
{"post": ["There are a big problem forum moderaters think we all have fluent knowledge about cryptocurrencies.but we are newbies and and still comes here to learn about cryptocurrency soo we do not have  good knowledge to post more valuble things .soo pleas give us time to learn"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "Smpdytz1", "subject": "Re: Forum moderation policy", "message_number": "#589"},
{"post": ["Hello, are airdrops replies considered as scam since there is no content in those posts?"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "AgiMarley2", "subject": "Re: Forum moderation policy", "message_number": "#590"},
{"post": ["What does \"uninteresting\" actually mean? Is it just about the relevance of the post to the topic or about the novelty of the post? "], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "KBB BIHAG", "subject": "Re: Forum moderation policy", "message_number": "#591"},
{"post": ["I think one pointless post would be the repition of another post. What if the idea is repeated, at least, similar only, but said in another way, will it be pointless?"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "sicnarfair", "subject": "Re: Forum moderation policy", "message_number": "#592"},
{"post": ["To me these are too many regulators and moderators who act with impunity who leave this place like some very despicable tyrannical forum. Even though I've got messages that have been deleted just because I expect someone to commemorate birthday celebrations and even though it's their birthday, this topic is not considered in the topic. Nor did they respond to complain because the person who had been removed never sent a counter option. "], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "jhonnydeep87", "subject": "Re: Forum moderation policy", "message_number": "#593"},
{"post": ["Merit is given by people to users who's posts they find informative or helpful. As for the score, people can give anywhere between 1-50 merit points per post but this is up to the individual."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#594"},
{"post": ["Personally, I'm glad that there were merits. creating this graduation, the forum administration limited the flow of people. and it is right. chat is not rubber. less people, more oxygen"], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "GavenJack", "subject": "Re: Forum moderation policy", "message_number": "#595"},
{"post": ["That would lead to  a large scale of moderation which would limit free speech as opposed to nudging posts towards civility and relevant content with a given group."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "SharkCoinerHD", "subject": "Re: Forum moderation policy", "message_number": "#596"},
{"post": ["i can comply the all points but the point 3 its more diff for a not native english guy like me that also uses ezquiziofrenia as a excuse for not posting too good interseting comments just the point 3 that is not very good the rest i can comply thanks."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "mitha rosdiana", "subject": "Re: Forum moderation policy", "message_number": "#597"},
{"post": ["This explains the reason why some of my comments have been removed. Is this moderation done manually or by some bots? Also, aside from the obvious spam replies, is there any other way you identify spams based on the content of the post? Some posts might appear spammy in nature but in their true essence are not spams."], "page_number": 10, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "Adeyemi", "subject": "Re: Forum moderation policy", "message_number": "#598"},
{"post": ["I dont think its good because its the means of getting merit point for many newbies. moderate shouldnt be so tough "], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "windyharm", "subject": "Re: Forum moderation policy", "message_number": "#621"},
{"post": ["This is a big issue for me,why my other post been deleted,i dont know the reason, if it is erroneous or manually deleted."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "mkcube", "subject": "Re: Forum moderation policy", "message_number": "#599"},
{"post": ["Take a look at the ", " and see if you can work out which rule you broke. (Hint rule 1. No zero or low value, pointless or uninteresting posts or threads. is usually the winner)."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.580", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#600"},
{"post": ["1558678231"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["What is considered referral code spam? One of those full on advertising posts with referral codes all over it like were posted when tradehill opened? What if it's a little more subtle? What about low content posts with the code in the signature?", "I guess what I'm trying to ask is, is there any reason to not just fully ban referral codes? They're mostly just spam and don't really benefit the forum any. And then it'd be a clear enforceable line.", "Just a thought."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "woozikai", "subject": "Re: Forum moderation policy", "message_number": "#622"},
{"post": ["\"zero-value\" \"entertaining\" \"pointless\" \"uninteresting\"  ", "All these words are opinion based. they do for the forum what the term \"terrorist\" did for america. I agree, honest is best, remove \"free speech\" from the list. maybe you would want to consider adding \"no slandering of individuals reputation\" considering posts like this one:", "It's just not right for people to talk about things like this is public.", "EDIT:", "looks like i really put my foot in my mouth this time, maybe we shouldn't lock threads based on peoples accusations of other people:"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "rapmon", "subject": "Re: Forum moderation policy", "message_number": "#623"},
{"post": ["1. Free speech - you can say anything as long as it is relevant and presented in a calm and polite manner. Swearing, SHOUTING etc. make your post more likely to be removed.", "2. No zero value posts or threads, like \"SELL SELL SELL\"", "3. No pointless or uninteresting threads.", "4. No referral code spam", "5. No NSFW content", ". . . . . . . . . . . . . . . . .", "These all sound reasonable to me, harmful but reasonable, number 1 is the most likely to be harmful to building the character of a robust community.", "I can see any number of posts that would be worthwhile and add to the character of this forum (to any forum) yet would fall foul of many of these caveats.", "For instance swearing is so culturally divisive that what might be seen as a genuine transgression by one person is simply humor (or more precisely 'humour') to another. From personal experience I know that - for example - Americans are can be offended by language that people from the UK are indifferent to, or even see as endearing, what to one person imbues a post with spirit and character to another renders it offensive.", "But of course nobody wants to have to 'listen' to someone hurling unnecessary and unwarranted abuse at another poster, so there is a real need to keep a check on this kind of thing, at least to some degree.", "I suggest you make a distinction between swearing per se and ad hominem, for example here are two examples . . .", "A) Oh, for fuck's sake I can't believe they've increased their fucking charges for THE SECOND TIME in a freaking month! This is really starting to piss me off, they are just going to drive business elsewhere . . . (and so on)", "B) It's clueless people like you who think you know it all, running around like some kind of genius telling everyone who will listen how great you think you are. Yet time after time you get it wrong and end up with the whole forum laughing at the sorry spectacle you have become, mostly through your own stupidity . . . (and so on)", ". . . example A contains swearing yet is (to these ears at least) not in the least bit offensive, example B is pure ad hominem, likely to elicit a similar response and is corrosive to the conversation.", "If on the other hand there is simply going to be a list of censored words then why not just use the BB software to track and change them, much like a US religious forum, so 'shit' becomes 'poopy' - and 'no fucking way!' becomes 'no damn way'.", "Personally I think this kind of thing is a move in the wrong direction, I am a member of a cycling forum in the UK that has zero moderation and the tone and sense of community is something even the best drawn up list of rules could not come close to, the forum has grown from nothing to 50,000 + and suffers none of the problems lists of rules like these seek to address.", "It's fucking great !", " Cheesy"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "Ayoyo", "subject": "Re: Forum moderation policy", "message_number": "#624"},
{"post": ["while i'm always pro transparency i see it's the right of the owners of this forum to delete as many posts as they want. you are free to leave. in fact i hope there will grow competition as with just one forum only, there is quite some power to manipulate the market by just randomly going offline."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "Tomosumi", "subject": "Re: Forum moderation policy", "message_number": "#625"},
{"post": ["I noticed I can't delete my own posts anymore.", "I used to keep my posts count low, deleting from threads to stop being notified", "now I can only edit the post but the delete link is gone", "will it stay this way, please?"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "jinchuriki", "subject": "Re: Forum moderation policy", "message_number": "#626"},
{"post": ["Make a public viewable Trashcan board in Other so that mods can move all trash-topics to the trashcan.", "The trashcan board should be locked for users to reply, only readable.", "Helps to educate users and prevent more garbage, users can see what undesirable content is.", "And if you want the board to be more serious you can create a \"Humor\" section so mods don't have to trash these, but just move to this board."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "dayvespa", "subject": "Re: Forum moderation policy", "message_number": "#627"},
{"post": ["Can we please get some moderation on the thread in which the asshole lawyer filed a trademark claim on bitcoin?  I agree he's a jerk and I'd like to see him disbarred or disciplined for filing a fraudulent claim, but the \"assassination market\" posts are too much and should be deleted.  The world is watching, and as someone who is investing thousands of dollars in a Bitcoin related-business, I'm very concerned about the image these forums are giving the world."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "ydaime", "subject": "Re: Forum moderation policy", "message_number": "#628"},
{"post": ["Hi! I wonder is there any moderation rule about moving stuff out of \"Bitcoin Discussion\"? I know it is very tempting to use it and not care about the sub forums and I think new projects deserve the publicity and come here but I wonder if it would make sense to aggressively try to move threads out of there when they are a week or two old? I'm referring to project specific stuff like:", "[ANNOUNCE] TORwallet - anonymous mixing wallet service (12-06-13)", "[Payout Updates] Bitcoinica site is taken offline for security investigation (12-05-28)", "BITCOIN MAGAZINE ARRIVED! (12-05-24)", "and many more that get bumped up for weeks and months and that I'm just tired of seeing as following them got far too off track, repetitive or plain pointless"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "bsan", "subject": "Re: Forum moderation policy", "message_number": "#629"},
{"post": ["After 9 years regular army and a lifetime as an interstate truck driver, I believe I've heard it all, but expletive suffused posts still drive me spare, so I excersise my own form of moderation, if you can't express yourself in a Proper manner than I will simply ignore your post, no matter how relevant, informative or interesting it may be.", "I've been part of ( and still am) many forums where offensive language is simply not tolerated, likewise with personal attacks involving race, creed, colour or religion, sexual proclivities or otherwise, yet the debate still remains robust.", "Free speech by all means, but with free speech comes responsibility too and a limitless courtesy and respect go a long way."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "saru99", "subject": "Re: Forum moderation policy", "message_number": "#630"},
{"post": ["We really want things to move forward.", "Fighting bots ans collateral dammages of Bounties Hunts.", "In the french section we try to make a change...", "Don't let Satoshi down!"], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "Corsicoin", "subject": "Re: Forum moderation policy", "message_number": "#631"},
{"post": ["Tip for new users. Do not write short messages. They are deleted. To prevent messages from being deleted, you must write long messages. My messages, which consisted of 10 words, were deleted. Activity = 0."], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "independence", "subject": "Re: Forum moderation policy", "message_number": "#632"},
{"post": ["This is nonsense. It doesn't matter how short or long your posts are but posts are removed for breaking the rules which you should read about here: ", "Your posts probably consisted of short pointless messages like \"thanks for this project\" or just saying things like \"watching\", \"great\" etc and that's why they will have been removed. Stretching your responses out to 10+ words wouldn't have helped in this instance. "], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#633"},
{"post": ["Does anyone else get the feeling that a lot of noob shitposters probably account farmers as well are posting garbage in these stickied threads ? I'm thinking they've learned that their posts get deleted in the spam threads when the whole thread gets nuked , so they're posting on ones they know aren't going to be. Or maybe that just my cynicism and paranoia speaking here. Still, I think the theory has some validity. I've recently reported a few zero value posts from stickied threads. "], "page_number": 11, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "Ferry5757", "subject": "Re: Forum moderation policy", "message_number": "#634"},
{"post": ["Yes, i have been scammed one tine, I'm only beginner in here and i want so badly invest bitcoin, I don't think about all. All about my mind is to investing bitcoin. I don't reseqrch my buyer/seller. So when i experience this, it gives me a lesson and after that before i invest or buy coins. I'm check if it is legit or not"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "Souldream", "subject": "Re: Forum moderation policy", "message_number": "#641"},
{"post": ["Sometimes the irony is just too much:"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#635"},
{"post": ["For the life of me I dont understand why bitcointalk allows posters to self moderate or lock topics in the marketplace. This is an invitation for Scammers and its like telling them welcome here, start your scam!!", "This forum has turned into a Scammers paradise. Wonder who put this crap policy that they can self moderate.", "Just think about a minute for it and the consequences of how many people are getting ripped off. One must be mad to allow this."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "nanohits", "subject": "Re: Forum moderation policy", "message_number": "#636"},
{"post": ["Exceptional concern about the Altcoin resources thread. For some company(not all) it seems like 100 threads for just one bounty/airdrop campaign. Sometimes it hard to track. there should be an one stop support for all bounties in one thread for one company. Sometimes I actually found the members are submitting their weekly process by adding reply rather than editing first reply of thread. It makes the thread more complicated and hard for bounty administrator to track"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "Jemcrew", "subject": "Re: Forum moderation policy", "message_number": "#637"},
{"post": ["Perhaps was counted as \"pointless\" or \"repetitive\" (to the one that handled/trashed it):", "More rules can be found on this thread: "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "SFR10", "subject": "Re: Forum moderation policy", "message_number": "#638"},
{"post": [" It can't possibly get much better than that!  Too funny."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "xhomerx10", "subject": "Re: Forum moderation policy", "message_number": "#639"},
{"post": ["I think the moderation policy has to be kept, even though I have been a victim over time, that is because for any organization to function effectively, there has to be a policy, guidelines or rules and regulations guiding that organization. So we need not to be angry over the actions of the moderator in this forum. For me, i have been worn severally but yet am still here, trying to do the right thing in order stay in the forum."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.620", "author": "Afinity26", "subject": "Re: Forum moderation policy", "message_number": "#640"},
{"post": ["1558678231"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["do you still feel that the rules in this forum are not yet tight? The merit system has made many people despair."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "maxwelll", "subject": "Re: Forum moderation policy", "message_number": "#642"},
{"post": ["Many new users try to gain activity by posting a random question such as \"here's an article about $TOPIC, what do you think about it?\", and then we have another spam megathread. I'm thinking that introducing a new topic should require a reasonable amount of intelligent (and obviously non-plagiarised) discussion by the thread starter and that topics lacking such introductory discussion should be deleted."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "bitperson", "subject": "Re: Forum moderation policy", "message_number": "#643"},
{"post": ["For me as a new member it is right to have a moderate policy in answering some questions because other may think that they can bully or they answer in sarcastic without knowing it. Answering in a good way,eventhoug there is something grammatical error may be considred if we answer it correctly."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "Cairo18", "subject": "Re: Forum moderation policy", "message_number": "#644"},
{"post": ["Can I selling ICO whitelist accounts  on this forum, or I will be banned for that?"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "DmitriyBorisov91", "subject": "Re: Forum moderation policy", "message_number": "#645"},
{"post": ["What exactly is a ICO whitelist account? You mean bitcointalk accounts or something else? Most things can be sold here as long as they're not illegal so you'll probably be ok but I'd need clarification before I could give you a definitive answer. "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#646"},
{"post": ["I mean account on ", " with approved KYC, ready to particulete on ICO   "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "DmitriyBorisov91", "subject": "Re: Forum moderation policy", "message_number": "#647"},
{"post": ["I mean, I am all up for this. It's difficult for the moderators and admins to maintain the forums, especially when there are lots of contents that are only made to add a post whether for their requirements in campaigns or to rank up their membership. However, I may also add that it's just a bit too indiscriminate sometimes because I have personally experienced about three even four of my posts being erased when I always ensure that the contents of my reply are on point plus the topics I select are those considered \"hot\" or reply-filled threads. So, sometimes, I ask myself, what is their rating to delete a post or thread, I just feel that sometimes it's too subjective."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "bitctrimor1", "subject": "Re: Forum moderation policy", "message_number": "#648"},
{"post": ["I've been having problems with my account since last year because their is no way I could get informations like this when I was a newbie. ", "I admit that I copypaste a post when I was a newbie, but I was just a boob back then. I later got banned when I became junior member.  Till date no moderator sees my query as reasonable. Some moderator will even respond to me negatively, just because i seek for their help, I don't know how to classify that type of behavior. ", "I really hope that a moderator will help someday. ", "Account username @Jameseversmile "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "Evasdiamond", "subject": "Re: Forum moderation policy", "message_number": "#649"},
{"post": ["Why nobody can answer about selling ico accounts?"], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "DmitriyBorisov91", "subject": "Re: Forum moderation policy", "message_number": "#650"},
{"post": ["It might be because this is the Bitcoin Forum and not the ICO Forum so noone really cares. As long as it is not illegal and you are selling them for Bitcoin you can sell anything here."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#651"},
{"post": ["You already got an answer. Is it illegal to sell? If so, then no. I'm still not even sure what you're selling but if you're selling an account with somebody else's personal details or verifications then probably not. "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#652"},
{"post": ["Have you all considered the function to appeal when an user is removed or banned? I ask this because it could exist the situation where a moderator can be wrong."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "electrobit", "subject": "Re: Forum moderation policy", "message_number": "#653"},
{"post": ["I’ve had a couple of posts deleted over free speech  "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "Craigjohnstone", "subject": "Re: Forum moderation policy", "message_number": "#654"},
{"post": ["Well, maybe you should check those posts, some moderators are good, others ones just are not agree with some posts and they delete or ban. "], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "electrobit", "subject": "Re: Forum moderation policy", "message_number": "#655"},
{"post": ["This is the job of the moderators and staff to clean out the forum from unwanted posts, topics and discussions.", "If you didn't received a notification that you post is deleted then it only means that the whole thread you posted was moved to the trashcan. ", "Don't post on those threads that are obviously nonsense discussions and topics so that next time you are aware that posting there is useless because it adds no value to the forum as a discussion."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "sunsilk", "subject": "Re: Forum moderation policy", "message_number": "#656"},
{"post": ["This is all true. I'm a new member and already reported in last days 2 of them. One was in this thread. I haven't report nothin sooner but I have just enough of this spam. Report and put on Ignore and reading quality is much better."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "crypto mania", "subject": "Re: Forum moderation policy", "message_number": "#657"},
{"post": ["My friend had negative experience with forum moderation policy. he began his activity on this site some months ago at the first time.And used only one off-topic chat and posted there jokes by copy-paste. So in two weeks they just banned him."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "natalagerman95", "subject": "Re: Forum moderation policy", "message_number": "#658"},
{"post": ["Or maybe he copied and pasted like you are:", "This thread is a honeypot for copy and pasters. I catch one almost every day."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#659"},
{"post": ["Its hard to move on if you not knowing what happening about spam. now is the time to make changes to the beginner of this bitcoin rules we need to reading searching wisely."], "page_number": 12, "url": "https://bitcointalk.org/index.php?topic=20333.640", "author": "Dark_Felix", "subject": "Re: Forum moderation policy", "message_number": "#660"},
{"post": ["Hi! Newbie here, anyone can explain me the meaning of NSFW content.tnx and god bless us all."], "page_number": 13, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Bashcarter", "subject": "Re: Forum moderation policy", "message_number": "#561"},
{"post": ["how must it would  be difficult  to implement a voting system for posts using the latest forum software."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "RIYA0001", "subject": "Re: Forum moderation policy", "message_number": "#541"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["Have you ever heard the thing called Google? It's a pretty cool website that you can use as a search engine to find anything you're curious about without the need to make a post, especially here."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Jeremycoin", "subject": "Re: Forum moderation policy", "message_number": "#562"},
{"post": ["In my opinion forums should be more tightly controlled posts. Forum can recruit more staff to censor daily articles to avoid spam posts"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "HarleyQuinn9876", "subject": "Re: Forum moderation policy", "message_number": "#563"},
{"post": ["My buddy had negative view upon forum moderation policy. He started his movement on this site a few months prior at the first time. And utilized just a single off-subject chat and posted there jokes by copy-paste. So in two weeks they simply close his account."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "ICOfighterr", "subject": "Re: Forum moderation policy", "message_number": "#564"},
{"post": ["Your shitposting \"buddy\" should have read the rules."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#565"},
{"post": ["How difficult would it be to implement a voting system for posts using the current forum software?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Huyngo3008$", "subject": "Re: Forum moderation policy", "message_number": "#566"},
{"post": ["Doesn't this notice reduce the flow of information and drive anyone else mad: ", "''The last posting from your IP was less than 360 seconds ago. Please try again later. The thing you were trying to post was saved as a draft. This limit decreases substantially as your account becomes more established''", "Jon"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Jonshackleton", "subject": "Re: Forum moderation policy", "message_number": "#567"},
{"post": ["You have to thank the spambots for that, the forum would be in a far worse state than it is if that restriction was lifted. It does get better quite quickly as your activity level increases. If it is major problem to you then you can buy a copper membership to reduce the time limit. "], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#568"},
{"post": ["Can I write comments: \"buy and hold\" or smth like this?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "al.nechiporuk", "subject": "Re: Forum moderation policy", "message_number": "#569"},
{"post": ["It is good policy l don't like those piramide looks like quotes in quotes and cannot", "understand why folks do such posts.", "Pictures are good but only if they are not offencive..", "That is why we must have small moderation."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "raaaj200", "subject": "Re: Forum moderation policy", "message_number": "#570"},
{"post": ["Not if you're just merely posting \"buy and hold\" as that contributes little to nothing. ", "Yeah, those are annoying and often unnecessary and should be trimmed by users to the relevant parts really. I believe in the new forum software that quotes will be automatically collapsable which will help."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#571"},
{"post": ["In what way do you find it difficult to participate in discussions? What you must do is to look for those threads that you really want to join and it's on your interest. Don't comment to a topic that you really don't know and you don't have interest of knowing what that topic is all about. If you'll try to join to those discussions without knowing and understanding any single word you are about to say, you will lead yourself to post off topic comments that are unnecessary to the discussion."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "passwordnow", "subject": "Re: Forum moderation policy", "message_number": "#572"},
{"post": ["I agree with the rules of the forum.", "However, sometimes I find it difficult to make discussions on the forum.", "Because of:", "- When writing content expressing emotion about a project or comment like \"good project\", \"Very good\", ... the content is still considered offensive, not worth the price !! !", "- I do not understand \"No NSFW content\" is like?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "jasmine226", "subject": "Re: Forum moderation policy", "message_number": "#573"},
{"post": ["What are other possible statements what when made, could result into being ban?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "oye1980", "subject": "Re: Forum moderation policy", "message_number": "#574"},
{"post": ["I think she/he is  referring to the account here in the forum. You can email the help center for you to retrieve your account or better not to violate the policy this forum."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "jackielim", "subject": "Re: Forum moderation policy", "message_number": "#575"},
{"post": ["Is it helpful to report a post speaking their native Language? I see lots of post who happens to be posting in this foum with their own language instead of posting to their own local board."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Maus0728", "subject": "Re: Forum moderation policy", "message_number": "#576"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["If a member has been banned, can he still recover his account? Thank you so much. Please let me know if you can help me. "], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "bagsangi", "subject": "Re: Forum moderation policy", "message_number": "#542"},
{"post": ["If it didn't say it was a tempory ban for a specified period then the ban is permanent, so no it can not be recovered. You will have been given an email link to send an appeal to. It is very rare and only in exceptional circumstances that an appeal will be successful. Also making a new account and starting again is ban evasion so if you get caught doing that you will probably get banned again."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#543"},
{"post": ["What kind of Ddos attack ?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "abdelhamid1993", "subject": "Re: Forum moderation policy", "message_number": "#544"},
{"post": ["This is a great new implementation by bitcoin organisation to implement this new rule. There is just too much cyber junk floating around in bitcoin. Now at least the bad posters will have a reason to stop"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "baturradenx", "subject": "Re: Forum moderation policy", "message_number": "#545"},
{"post": [" I thought we’d lost but looks like we may still make it?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "phuong thu", "subject": "Re: Forum moderation policy", "message_number": "#546"},
{"post": ["and who will define, an interesting post or not... this opinion is subjective. a lot of things it is interesting to me, but also it is a lot of not. here so then also it turns out that ban for anything..."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "ruslankempel", "subject": "Re: Forum moderation policy", "message_number": "#547"},
{"post": ["Yes, agree. We really Appreciated and we thank for consideration. Sometimes our post  has been deleted even though it is related to the topic. And also to those account that has been banned, We lost our activity that we've been working, can retrieve our accounts? Thanks! "], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "kallen02", "subject": "Re: Forum moderation policy", "message_number": "#548"},
{"post": ["Staff decide, but of course it is subjective. Staff aren't going to remove posts just for the fun of it though so it really needs to be a worthless contribution for it to be considered for removal. Lots of people report posts that they think are pointless and sometimes the staff agree and sometimes they don't, but users here aren't banned just for 'anything' and are done so for breaking a serious rule. This forum is probably one of the most liberal on the internet and in fact many would and have argued that moderation here is too lax.", "Just because it is related to the topic doesn't make it relevant or important. Stating an answer that has already been given is pointless and should be removed even if you put some effort into the answer.", "Not if it's permabanned. However, you can create a thread in Meta requesting unbanning on specific accounts. "], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#549"},
{"post": ["I would like to inquire if it is ethical posting something you had written about bitcoin in another forum or website, for instance, an article. Is that considered ethical or unethical on the forum?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "dotcomwriter", "subject": "Re: Forum moderation policy", "message_number": "#550"},
{"post": ["It's not unethical if you actually wrote it. However, I'd probably mention that you have posted it elsewhere or properly quote and 'source' yourself to avoid any issues as if it looks just like a copy and paste you may get banned so best to err on the side of caution. "], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#551"},
{"post": ["Moderation policy is a thing of respect. It would be very unethical and unwise to go against it. Many members of the community tend to violate policy without intention, so that's something for administrators to take into account before going for strict measures."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "ViceTemple", "subject": "Re: Forum moderation policy", "message_number": "#552"},
{"post": ["I wonder what is the definition of low value. Value is relative. to one person it might be of high value and relevant while to another it might be of no value. How will you determine if something or a post is of low value to everyone?"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "QuartzMen", "subject": "Re: Forum moderation policy", "message_number": "#553"},
{"post": ["How about you read the actual posts of the thread you're in because asking something that has already been asked and answered is low value:", "Edit. But do you want to know what is really low value? Copy and pasting posts:", "The irony."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#554"},
{"post": ["What will happen with the banned accounts?? how they can restore their accounts??"], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "airdrop1", "subject": "Re: Forum moderation policy", "message_number": "#555"},
{"post": ["Which account? Depends what it was banned for but if it's permanent for breaking a rule there's nothing you can do. However, create a thread in Meta about it if you want clarification on a specific case."], "page_number": 14, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#556"},
{"post": ["What if I have to report about. If say my topic is removed and I want to ask about the reason?"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "bakerlisa510", "subject": "Re: Forum moderation policy", "message_number": "#521"},
{"post": ["Of course, it is.", "As the member of this forum, it is our duty to keep this forum clean and safe."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Jeremycoin", "subject": "Re: Forum moderation policy", "message_number": "#577"},
{"post": ["Hi guys, I'm still new here on Bitcoin Forum. I want to know more about the policy and rules. Are there any other specific rules or things to avoid so I won't be banned or restricted? Like how many posts or comments a day am I allowed?"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "axelkeith02", "subject": "Re: Forum moderation policy", "message_number": "#578"},
{"post": ["It's up to you just don't spam and be on topic.", "AFAIK there's a trashcan board when threads are deleted it automatically goes there and it's only visible for the mods but not for us."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "jossiel", "subject": "Re: Forum moderation policy", "message_number": "#579"},
{"post": ["Is everybody giving comments here still available? ", "How can I get upgraded? ", "Thank you."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.560", "author": "Wearechampion", "subject": "Re: Forum moderation policy", "message_number": "#580"},
{"post": ["How can we restore a banned account"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "Ahmstar", "subject": "Re: Forum moderation policy", "message_number": "#557"},
{"post": ["#I agree about no referral codes (except perhaps in the signature if not intentionally used as the main message like using a large and bold font or huge image).", "After all, most new bitcoin options (pools, exchanges, vendors, etc.) are largely discovered by posts here.  Referral codes could be banned outright if people abuse it in signatures, but I suspect most if not all will be responsible. "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "A.nayem", "subject": "Re: Forum moderation policy", "message_number": "#558"},
{"post": ["I heard something wrong is going on with the current threads being escalated here and there.", "Is this thing stiill going to continue or we should wait for its clean-action?"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "RanieriClaudio168", "subject": "Re: Forum moderation policy", "message_number": "#559"},
{"post": ["This is to remind ALL that Bitcointalk is a community of people to share RELEVANT AND USABLE INFORMATION for sole purpose of training, guidance and support to better members through QUALITY POST and we will uphold this pillar.", "Low quality or irrelevant post will not be allowed as we shall altogether help one another to get better on this platform. Thanks"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.540", "author": "moneyafric", "subject": "Re: Forum moderation policy", "message_number": "#560"},
{"post": ["1558678231"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["You can post a thread on the Meta board to ask. The most common reason for threads to be removed is that they have been posted on the wrong board. Make sure you read the description of each board to be sure you put it in the correct one."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#522"},
{"post": ["We have the freedom of speech but we have our limitations. We cannot always say all what we are thinking. Being smart at using words is a responsibility."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "_Mikasa_", "subject": "Re: Forum moderation policy", "message_number": "#523"},
{"post": ["Is there any possible way to un-ban a profile?"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "Nana21", "subject": "Re: Forum moderation policy", "message_number": "#524"},
{"post": ["Depends what account it is and what it was banned for."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#525"},
{"post": ["What is considered referral code spam? One of those full on advertising posts with referral codes all over it like were posted when tradehill opened? What if it's a little more subtle? What about low content posts with the code in the signature?", "I guess what I'm trying to ask is, is there any reason to not just fully ban referral codes? They're mostly just spam and don't really benefit the forum any. And then it'd be a clear enforceable line.", "Just a thought."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "RedUkulele", "subject": "Re: Forum moderation policy", "message_number": "#526"},
{"post": ["I would prefer a full on blanket ban on them to be honest, though I think they're fine in signatures. If people are making low quality posts then they should be dealt with regardless of whether they have a ref code in their signature. However, sometimes they can be useful for companies. For instance, you may want to track how many users are signing up via your thread on bitcointalk or a specific users signature to measure how effective promotion is here and I think that's fine."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#527"},
{"post": ["most new bitcoin options (pools, exchanges, vendors, etc.) are largely discovered by posts here.  Referral codes could be banned outright if people abuse it in signatures, but I suspect most if not all will be responsible.  Besides, I only know of one referral code scenario right now anyway and they don't even need to offer it thanks to their competition."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "NERDNERDNERD", "subject": "Re: Forum moderation policy", "message_number": "#528"},
{"post": ["agree, but while writing try to be more subjective, things that you find uninteresting may be interesting for someone else"], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "edward222", "subject": "Re: Forum moderation policy", "message_number": "#529"},
{"post": ["We need more than one Bitcoin forum. When a forum gets so big that they basically tell people to \"go\", and they start removing posts from left and right, without slowing down in registrations, membership, or traffic - telling ME (at least) that the Market is now big enough to other forums."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "Dennbagus008", "subject": "Re: Forum moderation policy", "message_number": "#530"},
{"post": ["1. Free speech", "Hi, ", "I'm a new member in this BTT and i agreed about the guidelines. This was my very first post and i hope its ok and not violating any rules. "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "jhamz03", "subject": "Re: Forum moderation policy", "message_number": "#531"},
{"post": ["If one looks at what the whole of what you wrote above, the only thing of substance is that you are basically saying \"I agree\".  Everything else you wrote is basically irrelevant to the subject.", "In most discussion forums and I'm 99% certain it's also the case here, bumping or saying \"I agree\" is the most fundamental form of spam or otherwise a tactic to increase post count.", "Don't be surprised if your \"first post\" disappears."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "Realist247", "subject": "Re: Forum moderation policy", "message_number": "#532"},
{"post": ["This has to be really implemented. Some posts or comments don't seem to be relevant to the topics. I  think, it's better if the moderator filter the attempts to post for a certain topic. Well I agree that selling in this kind of discussion groups must be prohibited. It is also a must that links posted here should be confirmed to be free of virus or spam free for the safety of the members of this discussion group."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "Apened", "subject": "Re: Forum moderation policy", "message_number": "#533"},
{"post": ["One of my friend got his Free Speech deleted on their local board. And its on the welcome to newbie thread. He basically said he was enthusiastic in learning and very grateful that there are guides to help newbie on their local board. I've actually read a post on whats not ot post, but there is no clear parameter on what to post. Newbie here and I am trying to follow the rules as much as I can. Thanks. "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "roy.ashton", "subject": "Re: Forum moderation policy", "message_number": "#534"},
{"post": ["Im brand new looking to get started on YDX, I'm looking for yassin54, my search for him keeps saying \"temporary unavailable\". Thank you  "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "jlc3312", "subject": "Re: Forum moderation policy", "message_number": "#535"},
{"post": ["Search was temporally disabled due to the DDoS attack but has now been re-enabled so it should work if you try again. "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#536"},
{"post": ["Even if it said as \"free speech\", it should be very relevant, constructive and helpful. Forum was made for clarification, answering queries, to help other people and for our both benefits. "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "ProphetDaniel", "subject": "Re: Forum moderation policy", "message_number": "#537"},
{"post": ["First point is actually correct. I have seen my friends accounts  getting banned for posting irrelevant posts and over postings. For a newbie, there should be only 1 post a day. and the content should include from 50-100 words. Otherwise, there's a possibility of your account getting banned from signature campaign and from bitcointalk as well. "], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "kakrotssj1", "subject": "Re: Forum moderation policy", "message_number": "#538"},
{"post": ["There is no limit or requirement on the number of posts or the number of words in them in the forum rules. People get banned for posting irrelevant uninteresting posts just to increase their post count.", "Signature campaigns are different and all have their own individual rules.", "Rule number one in the ", "If you are making a valuable contribution to a discussion then you can post as much as you like."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#539"},
{"post": ["Allowing only one post is overkill. We have the Activity system in place to prevent abuse so you can't spam your way through ranks. Making a post meet some minimum character or word count would also be counter productive as people will just ramble on needlessly. Users will also find a way to cheat it as they have done with signature campaigns by adding obscured junk into their posts by changing the colour and font size etc."], "page_number": 15, "url": "https://bitcointalk.org/index.php?topic=20333.520", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#540"},
{"post": ["Here a suggestion: Some ANN. post should be put under discussion before they get thrown the thrash Happened to me :/", "Btc is rocking it in spite of all these FUD ", ". "], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "lapp1", "subject": "Re: Forum moderation policy", "message_number": "#601"},
{"post": ["1558678231"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["Well its good to have much more strict rules nowadays.. ", "I maybe in this rank, but im an active reader here.. Soo many spams and just the same topics are thrown in the discussions nowadays.. ", "Just a suggestion, ", "I was thinking of the higher ups on making a standard rule that only those high ranking members like (Members or something like that) can open up a new discussion or topic..", "And for posts, i guess it would be much better if there is a standard minimum of number of characters before it can be posted on a discussion..  . I mean that would extremely lessen the spams and \"zero-valued posts\" right??", "Because as what i have observed, mostly of those spams are just being done for the sake of being promoted into higher ranks.. especially those \"SELL SELL SELL\" thing.. because this is for discussions and for forums not for those posts.. ", "Just saying..  "], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "dexterbulate4546", "subject": "Re: Forum moderation policy", "message_number": "#602"},
{"post": ["This forum is founded on the idea that you shouldn't censor or ban people for disagreeing with you, especially in a community like Bitcoin, where disagreement is pretty much inevitable. I don't see why we can't try something like voting for moderators, similar to how it works in some subreddits."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "Alopu", "subject": "Re: Forum moderation policy", "message_number": "#603"},
{"post": ["I think the forum was created for everyone, regardless of nationality and religion, people have the right to express their opinions. But there should be rules of the forum as not to post political or religious articles, non-forum related posts, private ads"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "MDLuffy", "subject": "Re: Forum moderation policy", "message_number": "#604"},
{"post": ["Even as a beginner  I'd prefer to read and posts substantial, helpful and informative matters. It is just right to remove irrelevant posts.", "It's just that it may not be easy to earn merits to rank up especially if your posts go unnoticed/unappreciated by people who could give u merits."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "Jadeite", "subject": "Re: Forum moderation policy", "message_number": "#605"},
{"post": ["How difficult would it be to apply a voting system for posts using the current forum software? Actually, always have to be careful about its policy."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "medha2009", "subject": "Re: Forum moderation policy", "message_number": "#606"},
{"post": ["Sure a lot of crap is dropping it gets me piss off. Forum should be moderated!"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "Neurocrypt", "subject": "Re: Forum moderation policy", "message_number": "#607"},
{"post": ["As long as it's not goatse, Alex Beckenham has a major point.", "Also, some of the 'useless' threads are actually quite entertaining, if not educational (e.g. the Rawdawg and Bitcoin snail graph/meme ones).", "I agree with the referral code one, though even that was interesting to see, some people are quite creative"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "bakulsandal21", "subject": "Re: Forum moderation policy", "message_number": "#608"},
{"post": ["What is considered referral code spam? One of those full on advertising posts with referral codes all over it like were posted when tradehill opened? What if it's a little more subtle? What about low content posts with the code in the signature?", "I guess what I'm trying to ask is, is there any reason to not just fully ban referral codes? They're mostly just spam and don't really benefit the forum any. And then it'd be a clear enforceable line.", "Just a thought."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "bts378", "subject": "Re: Forum moderation policy", "message_number": "#609"},
{"post": ["\"zero-value\" \"entertaining\" \"pointless\" \"uninteresting\"  ", "All these words are opinion based. they do for the forum what the term \"terrorist\" did for america. I agree, honest is best, remove \"free speech\" from the list. maybe you would want to consider adding \"no slandering of individuals reputation\" considering posts like this one:", "It's just not right for people to talk about things like this is public.", "EDIT:", "looks like i really put my foot in my mouth this time, maybe we shouldn't lock threads based on peoples accusations of other people:"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "mitsuki", "subject": "Re: Forum moderation policy", "message_number": "#610"},
{"post": ["It means that it is not permitted to put a referral code anywhere in a post so they are effectively banned already. The exception to this is your signature where you are free to advertise a referral link if you want. Low value posts are also banned under rule 1 of ", "."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#611"},
{"post": ["I have a concern regarding the Altcoin bounty thread. For some company(not all) it seems like 100 threads for one bounty/airdrop campaign. Sometimes it hard to track. there should be a one stop support for all bounties in one thread for one company. Sometimes I found the members are submitting their weekly task by adding reply instead of editing first reply of thread. It makes the thread more complicated and hard for bounty manager to track.", "My apology if i made any mistake."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "shazib083", "subject": "Re: Forum moderation policy", "message_number": "#612"},
{"post": ["how must it would  be difficult  to implement a voting system for posts using the latest forum software."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "MadelynCohen", "subject": "Re: Forum moderation policy", "message_number": "#613"},
{"post": ["  Listen I'm not much of a social media (or forums) guy, but I've been involved with crypto for around a year now and its not necessarily this website but most definitely reddit that makes my stomach churn. This arrogant sentiment is on bitcointalk as well. How about the fact that i cant even message anything on the crypto reddit threads because I don't have enough Karma and so-forth. Even if one does get a post or comment past the totalitarian moderators with their despotic inclinations and impulses that could rival even current North Korean leader Kim Jong Un, the next step will be confronting the conceited rhetoric espoused by some lowlife in the comment section who has no time for someone who understands less than he does. This is nothing more that a catch 22. I don't have i certain level of respect within the community because i am not of a certain level, but i cannot get that respect and post because i don't meet their standards. What a joke. I cant even get airdrops because i am not deemed worthy enough."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "JAA37", "subject": "Re: Forum moderation policy", "message_number": "#614"},
{"post": ["In the most time,we cannot come to a conclusion without the acquaintance,but what we should remember is that everything needs the time.In the meanwhile,the regulation is necessary.Nothing can be accomplished without norms or standards."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "BCEX", "subject": "Re: Forum moderation policy", "message_number": "#615"},
{"post": ["A reliable moderation policy is necessary for successful community engagement. A good moderation policy should be accessible, light-touch, and trustworthy."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "stephylarde", "subject": "Re: Forum moderation policy", "message_number": "#616"},
{"post": ["Yeah, so new policy for moderation really needed specially those people who really like to rant..", "Well not that I'm better.! "], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "noelanora99", "subject": "Re: Forum moderation policy", "message_number": "#617"},
{"post": ["Moderators are stone hearted. when they needed pubicity they used people to get invloved more in posting and now they are excavating them"], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "rhombuschock8", "subject": "Re: Forum moderation policy", "message_number": "#618"},
{"post": ["I have followed all instructions on this post and now I re-visited it. But still, it's really weird and I wonder why my first account got banned.  ", "I never posted anything rude, all are just either asking or giving out information that I know of. Now I have to start all over again.  "], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "CryptoVerseStudent", "subject": "Re: Forum moderation policy", "message_number": "#619"},
{"post": ["That's the moderation policy and is only a tiny subset of the rules.", "Have a read of them and I'm sure you'll find which rule you broke (rules 1, 4 and 33 are the most common). That would be the only reason you were banned.", "Also, this rule should be interesting to you.", "25. Ban evasion (using or creating accounts while one of your accounts is banned) is not allowed.", "That's why your current account is likely to get banned as well."], "page_number": 16, "url": "https://bitcointalk.org/index.php?topic=20333.600", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#620"},
{"post": ["What about low content posts with the code in the signature ", " "], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "sehanmaxx01", "subject": "Re: Forum moderation policy", "message_number": "#481"},
{"post": ["1558678231"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["When there are several posts every second - how the moderator will manage to review if post is meaningful enough and well written? "], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "howtobuy", "subject": "Re: Forum moderation policy", "message_number": "#482"},
{"post": ["Look all the stickies especially in Meta board and also Unofficial rules. And as you have limit in searching, you can use external services like Google, just use site:bitcointalk.org after the word/line you want to search, eg: Unofficial rules site:bitcointalk.org"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Omang7778", "subject": "Re: Forum moderation policy", "message_number": "#483"},
{"post": ["Does anyone else get the feeling that a lot of noob shitposters--probably account farmers as well--are posting garbage in these stickied threads?  I'm thinking they've learned that their posts get deleted in the spam threads when the whole thread gets nuked, so they're posting on ones they ", " aren't going to be.  Or maybe that's just my cynicism and paranoia speaking here.  Still, I think the theory has some validity.   I've recently reported a few zero value posts from stickied threads.  "], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "The Pharmacist", "subject": "Re: Forum moderation policy", "message_number": "#484"},
{"post": ["No, you're right, they are posting shit but probably not because they know the thread won't get deleted. A lot of them will be using bots so maybe it just chooses the top thread and a lot of them are just copying posts from earlier in the thread as well. I nuke both instances."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#485"},
{"post": ["We all know that thousands of posts are being uploaded every second and then it becomes a difficult job for the moderator to cope up with the situation well. ", "I think the best policy that  is worth following in this case includes the consideration of following contents as inappropriate one such as personal information regarding any one, use of foul language and uploading the content that is highly sensitive such as  link for any website or so. The moderator can do his job in the best way only showing the content related to the topic and avoiding all other."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "prtty2gal2", "subject": "Re: Forum moderation policy", "message_number": "#486"},
{"post": ["Can you please refer me to thread that spell out all the short words or abbreviation that is regular used at bitcointalk post?"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Nana21", "subject": "Re: Forum moderation policy", "message_number": "#487"},
{"post": ["I don't think there is one. What words or abbreviations are you confused about? I'm sure somebody could help you out or write one up if there's demand but I don't recall seeing many native to here so a quick google search may be all that's needed."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#488"},
{"post": ["1. Free speech", "But why does my posts been deleted? All my post are related to the thread but it was removed im polite and i have manners,but still my posts are dumped. Can't understand."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Yazrielle", "subject": "Re: Forum moderation policy", "message_number": "#489"},
{"post": [" The forum moderation policy is very good. One point though; I think that you should remove \"uninteresting\" since that is completely subjective and there is no way an honest post can avoid it (readers determine interest, not the poster).  I think that \"pointless\" covers it well and is much more objective within the context of a group and easily covers \"intentionally uninteresting. It is so nice and helpful that bitcoin is so amazing and so awesome."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Sarah08", "subject": "Re: Forum moderation policy", "message_number": "#490"},
{"post": ["What's NSFW content? "], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "whalez", "subject": "Re: Forum moderation policy", "message_number": "#491"},
{"post": ["Not safe for work: ", ". "], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Lauda", "subject": "Re: Forum moderation policy", "message_number": "#492"},
{"post": ["I had a comment like", "This is a great project and I'll love to benefit from it. Why should that be deleted"], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Pearlfx", "subject": "Re: Forum moderation policy", "message_number": "#493"},
{"post": ["See rule 1 in ", "."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "mprep", "subject": "Re: Forum moderation policy", "message_number": "#494"},
{"post": ["This is very vague. ''Calm and polite'' need to be more defined."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Cryptelo", "subject": "Re: Forum moderation policy", "message_number": "#495"},
{"post": ["Where is Russian? I cant find it...Dont understand..."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "MariaDiesel", "subject": "Re: Forum moderation policy", "message_number": "#496"},
{"post": [], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#497"},
{"post": ["i wonder if bitcoin forum is really  forum or just a place where your opinion is monitored and  edited  to please  moderator mood", "total censure  for no reason", "if i post  in a ICO topic,  \"a project without public relation is  not a project\" ", "i dont see offending content  anyway  maybe the  MoD should Order ZORRO costume for Xmass or grow up ...."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Yamoto", "subject": "Re: Forum moderation policy", "message_number": "#498"},
{"post": ["I really don't think it was anything to do with your opinion. If you had expanded on your thought and explained why you think that, then it would not have just looked like a random comment posted by a spambot. As it was, it falls under forum rule No. 1, no low-value posts. Try and add some value to the forum and your posts will not get deleted."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "TheQuin", "subject": "Re: Forum moderation policy", "message_number": "#499"},
{"post": ["is there much to expand ?", "What is good in a ICO without Public relation ?", "i was postic in a specific ICO treads, who lack communicate with their token subscribers.", "Maybe need to write white and black the EVIDENT for the one who cant read the topic..."], "page_number": 17, "url": "https://bitcointalk.org/index.php?topic=20333.480", "author": "Yamoto", "subject": "Re: Forum moderation policy", "message_number": "#500"},
{"post": ["the most important thing about this issue is gonna be the policy. That ugly word comes a long way according to population control. "], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "ImFire", "subject": "Re: Forum moderation policy", "message_number": "#441"},
{"post": ["1558678231"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["Once i said it before policy is always a rule that comes back and bites you in the back. Freedom is better than policy in my eyes."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "aladinmax", "subject": "Re: Forum moderation policy", "message_number": "#442"},
{"post": ["And what is at your discretion that is post zero content ?", "Just sometimes the theme itself can be bad content in it,and any post there will be a minimum value for the forum.", "5 of course the above written criteria,but I think very few(", "And the fact that the forum is gaining momentum is only very good."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "JasperKornich", "subject": "Re: Forum moderation policy", "message_number": "#443"},
{"post": ["Without politics and no freedom of speech.", "I think the rules are the rules that would do better"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "Weber88", "subject": "Re: Forum moderation policy", "message_number": "#444"},
{"post": ["I hope more tightening on the forum will not.", "But honestly,with these new rules don't fully agree,but will have to live with them."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "yang13", "subject": "Re: Forum moderation policy", "message_number": "#445"},
{"post": ["You just have to write the correct positions and invest in them the essence.", "And of course ,very few people like that his posts are removed."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "KirovMs", "subject": "Re: Forum moderation policy", "message_number": "#446"},
{"post": ["The policy of moderation of course is good,but what about those who want to give their information,but it will be removed?", "Al, it turns out that human thought is heard,and suddenly she will change?"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "Shnayder", "subject": "Re: Forum moderation policy", "message_number": "#447"},
{"post": ["And what you do not like this policy,it all balanced and worked out for the good support this forum."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "Weber88", "subject": "Re: Forum moderation policy", "message_number": "#448"},
{"post": ["i think it is hard to make everyone happy, we need some rules to make our forum better and better. So the words should be valuable and meaningful."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "snowzk", "subject": "Re: Forum moderation policy", "message_number": "#449"},
{"post": ["Most obvious irrelevant activity should be checked out randomly. Implementing some rules against those junks would have Been a great idea."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "murtaja", "subject": "Re: Forum moderation policy", "message_number": "#450"},
{"post": ["Is there a thread to describe how your action goes up on here?"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "sergeyo9", "subject": "Re: Forum moderation policy", "message_number": "#451"},
{"post": ["I often swear on my posts when I'm genuinely mad about certain things. Other than that, I don't usually drop bomb words just to add up to my posts."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "iconicavs", "subject": "Re: Forum moderation policy", "message_number": "#452"},
{"post": ["Indeed. They make me confuse all the time. They are huge waste of time and space. They make me scroll and scroll and see nonsense things and aren't even related to bitcoin nor other business."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "iconicavs", "subject": "Re: Forum moderation policy", "message_number": "#453"},
{"post": ["I just posted about a topic whether Bitcoin will be replaced or not and it got deleted. \"There will be competitors but to replace, it will be difficult.\"  "], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "tigan_gangmei", "subject": "Re: Forum moderation policy", "message_number": "#454"},
{"post": ["What will be the criteria to determine low - value posts? Since this is forum for educating members, I think upcoming members need to be given the chance  up to full members to express themselve without any string attached. However as you said Free speech , does not guarantee misuse of this forum.Thank you."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "boakyei", "subject": "Re: Forum moderation policy", "message_number": "#455"},
{"post": ["Made a post regarding me and georgem banging sluts and hitting AZ casinos after he drops the highly anticipated SPR update", "Hope there are no snowflakes on here.", "Cuffy"], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "CuffNasty69", "subject": "Re: Forum moderation policy", "message_number": "#456"},
{"post": ["What about defamation/slander of someones character?  ", "Or do we just send them some Trollcoin.."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "redcable1", "subject": "Re: Forum moderation policy", "message_number": "#457"},
{"post": ["And the reason for that is because that's a post that states basically nothing.", "It adds nothing to any discussion, and it's obvious.  It's like saying the sky is blue, pay", "me for telling you that.  Whether you agree with it or not, those kinds of posts that ", "might fly on other discussion forums won't fly here.  Either add something substantial", "to a thread or don't add anything.", "Once again, respect to the moderators who are doing this.  I'd also suggest to those of", "you who are reading this, if you see a post like the one above that's an obvious shit", "post, report it."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "Pearls Before Swine", "subject": "Re: Forum moderation policy", "message_number": "#458"},
{"post": ["Hello sir, I use this site alot for research about crypto but I dont know If I can start a new thread to make a \"Crowdfunding\" in Bitcoins, I want to know if its possible to gather a good amount of BTC so I can leave my country.. Im from Venezuela and I think BTC is an opportunity to avoid all the controls my goverment have over foreign currencies.. If I can gather enough Bitcoins I will leave my country ASAP.. So I want to know How can I start a new Thread.."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "Royero", "subject": "Re: Forum moderation policy", "message_number": "#459"},
{"post": ["Good day. I noticed that there is a new incentive to delete the \"joined\" type posts (concerning the airdrops), and I am all for it. My question is if it is OK to post \"received the airdrop\" type posts.", "On one side that is not a very valuable post, but on the other side it is polite to thank the dev and to show to the others that the airdrop is legit (especially these days....)."], "page_number": 18, "url": "https://bitcointalk.org/index.php?topic=20333.440", "author": "dado7", "subject": "Re: Forum moderation policy", "message_number": "#460"},
{"post": ["all will be by itself, simply by reading and reading well you can certainly. or you search tau with your friends who already understand or know about things that you want, the land slowly you will find out. who want to want and want to try to be"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "Cacingkemi", "subject": "Re: Forum moderation policy", "message_number": "#421"},
{"post": ["1558678231"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["I like this forum especially it works eradicated all the spam possible .it is very  ", " ", " well"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "fanou1989", "subject": "Re: Forum moderation policy", "message_number": "#422"},
{"post": ["You can say anything as long as it is relevant and presented in good manner this is FREE SPEECH.", "There should beNo zero value posts or threads.", "There should be no pointless threads.", "There sholud not have NSFW content."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "Dakshkapoor", "subject": "Re: Forum moderation policy", "message_number": "#423"},
{"post": ["I think there should be a special policy in the discussion do not be too free people do post that passes the discussion so that the discussion can be organized and the discussion so do not deviate to other discussion.", "if there is a misconduct might have better delete his post only"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "bachtiar13", "subject": "Re: Forum moderation policy", "message_number": "#424"},
{"post": ["In light of the answer that was quite recently erased, I never broke a solitary run and I have no grumblings other than the issue with KWH. My chance on here has been okay. I am just expressing what I pursued into KWH had his little tantrum since I don't concur with his false proclamations."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "TheBobman", "subject": "Re: Forum moderation policy", "message_number": "#425"},
{"post": ["You can simply press the \"report to moderator\" option that can be seen on the right side of every post. And if you find those post that isn't right on the discussion, sort of off topic or disrespectful then hit that button and wait for the action of the moderator. Later on, those post will surely be deleted if they assessed that those posts are insubstantial or off topic."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "batang_bitcoin", "subject": "Re: Forum moderation policy", "message_number": "#426"},
{"post": ["this forum I like let alone work to eradicate all possible spam. That's very ..  ", " well", "Okay, I know I am a member on this forum My first question and maybe it is a stupid question ... what exactly is the content of \"this content?", "thank you"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "Dava.Dina", "subject": "Re: Forum moderation policy", "message_number": "#427"},
{"post": ["I hope the forums are moderated a little bit a lot more cautiously from now onwards. Spammers and individuals promoting some kind of advertisements ought to be banned absolutely."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "Therly", "subject": "Re: Forum moderation policy", "message_number": "#428"},
{"post": ["I don't know what your question is, and I don't understand anything you're saying.  What you wrote is a prototypical shitpost, and it shows very clearly that your English is such that you should be posting on some other forum or on a local board exclusively.   Those are classified by language.  You'll probably get banned if you keep posting like that."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "The Pharmacist", "subject": "Re: Forum moderation policy", "message_number": "#429"},
{"post": ["Who are the people that will be monitoring and \"policing\" the forum(s)?"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "Bruce Wayne", "subject": "Re: Forum moderation policy", "message_number": "#430"},
{"post": ["I am a newbie here, please give me a guide to do assigned tasks ,, if any writing errors please understand, thanks"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "salsabila MR", "subject": "Re: Forum moderation policy", "message_number": "#431"},
{"post": ["I am a newbie here. Please give me a guide to do assigned tasks. "], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "Aldrin sadewa", "subject": "Re: Forum moderation policy", "message_number": "#432"},
{"post": ["Have had quite a few posts deleted for no apparent reason. I have written well thought out posts (not SELL SELL SELL etc), still deleted. Probably overactive moderation."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "benzen", "subject": "Re: Forum moderation policy", "message_number": "#433"},
{"post": ["You must have had those well thought out posts deleted then because all I see are the usual one or two lines of mostly nothingness. I don't see anything of any substance at all."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#434"},
{"post": ["What is considered as referral spam?", "Can i start a thread that objectively discusses the benefits of a coin and post a link at the end?", "How about a poster about the pros and cons etc with my referral in it?"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "corytam", "subject": "Re: Forum moderation policy", "message_number": "#435"},
{"post": ["lots of hilarious comments,i appreciate the guidelines here, it makes this forum healthy, there's a saying that where there is no RULE, there is no Sin."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "tsmiles", "subject": "Re: Forum moderation policy", "message_number": "#436"},
{"post": ["No. Ref links are rarely allowed. You're explicitly just creating the thread to post the link."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#437"},
{"post": ["what about a \"last edited %CLOCK%\" function for edited posts??"], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "extr11", "subject": "Re: Forum moderation policy", "message_number": "#438"},
{"post": ["There already is one. If a post is edited the time/date becomes dotted and if you hover over it it tells you when it was last edited."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#439"},
{"post": ["That's right. This is a rather difficult task, but in this forum is all ok. Sam had some situations that some forum (not bitcoin) did not survive the mass attack of hackers. I think every forum should be prepared for such an eventuality."], "page_number": 19, "url": "https://bitcointalk.org/index.php?topic=20333.420", "author": "DrYe5", "subject": "Re: Forum moderation policy", "message_number": "#440"},
{"post": ["Can you please refer me to thread that spell out all the short words or abbreviation that is regular used at bitcointalk post? "], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "royalfestus", "subject": "Re: Forum moderation policy", "message_number": "#361"},
{"post": ["1558678231"], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["-> "], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "shorena", "subject": "Re: Forum moderation policy", "message_number": "#362"},
{"post": ["     This may have been answered somewhere between pages 4 and 19 but I stopped at pg. 4. Sorry, but there are many other interesting threads for one to read here. ", "   Regarding referral links:  There are a few sites that I use that offer a reward for posting your referral link in their thread, sometimes its just a user name they want you to post. There are thousands of pages wasted to this, 10's of thousands of posts. I am a guilty of contributing to this nonsense but the bonuses offered really make a difference in their games.", " ", "  My Question: Does the posting of one's referral link to a specific thread in which the sole purpose of that thread's creation was for the posting of one's referral                 link hurt one's member status, ranking, or overall reputation as a serious member of the community?  "], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "CHRISBIN702", "subject": "Re: Forum moderation policy", "message_number": "#363"},
{"post": ["If you consider receiving a ban for spam as something that hurts your member status, the answer is yes. You are not allowed to create a thread for ref links. Put it in your signature and be done with it."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "shorena", "subject": "Re: Forum moderation policy", "message_number": "#364"},
{"post": ["If you think about posting a referal link, I will find you and I will delete you."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "phantastisch", "subject": "Re: Forum moderation policy", "message_number": "#365"},
{"post": [" your kidding right? Have you seen the yabtcl thread. There are thousands. I have never posted a referral link outside of yabtcl's thread. ", "Why not answer my question instead of threaten. As a staff member I would expect you to at least read my post. Unless you have a bot that tracks down any occurrence of the words \"referral\" or \"link\" and then stack them with your super powered staff threats.I never said I was going to create atopic myself. I was asking about the ones that already exist."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "CHRISBIN702", "subject": "Re: Forum moderation policy", "message_number": "#366"},
{"post": ["I need help I am a new member but don't know how to post"], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "bc52", "subject": "Re: Forum moderation policy", "message_number": "#367"},
{"post": ["Looks like you figured it out. You need to wait some time after you have logged in, have posted or send a PM. This time will reduce over time."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "shorena", "subject": "Re: Forum moderation policy", "message_number": "#368"},
{"post": ["I have been a member for a long time and I am still a newb. I don't think rank matters that much here anyhow because only certain people decide what you can say and each one of those members may have hundreds of accounts that they use to manipulate the discussions. You will see that there are people here that it would be best not to disagree with. I don't say much here-I mostly just read. Rank isn't as important as the information that is available here-just beware what you believe because it seems that the higher the rank and trust level the more apt they are to deceit and they work in teams so be careful with your bitcoins if you have any yet."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "OneUnderBridge", "subject": "Re: Forum moderation policy", "message_number": "#369"},
{"post": ["As a new user of Bitcointalk, I've been very impressed by the attitude of the moderators.  I respect their approach of trying to wipe out spam while not being unrealistic by attempting to ban what is hard to stop (e.g. selling accounts), and not blocking anyone's view as long as it constructive and reasonable. This kind of moderation is generally quite hard to find as it's so easy for people on forums like this to become corrupt or authoritarian."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "LittleBitFunny", "subject": "Re: Forum moderation policy", "message_number": "#370"},
{"post": ["Simple solution: ban signatures. No more signatures, no more signature campaigns requiring umpty-five posts per week to get credit."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "NoiseBoy", "subject": "Re: Forum moderation policy", "message_number": "#371"},
{"post": ["I've been a longtime reader and tried to make my first post here, and I thought I wrote it pretty constructively and tried to raise some ideas for debate but sadly it was quickly deleted and I do not know why as it seemed to have been worded to be very relevant to the forum, not sure how I can contribute or be a part of the community if my posts are just deleted. I tried to click here to understand more on guidelines but couldn't see any detail here that would point to my post being taken down...can anyone chime in or help me out please?"], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "centralbanksequalsbombs", "subject": "Re: Forum moderation policy", "message_number": "#372"},
{"post": ["nevermind, I figured it out - there's a very helpful sticky thread here:", "My problem was lower on the list where I got a bit excited and re-posted my same post in multiple places! My bad.", "Thank you to the moderators for their hard work and keeping the quality."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "centralbanksequalsbombs", "subject": "Re: Forum moderation policy", "message_number": "#373"},
{"post": ["Did you report them?"], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#374"},
{"post": ["hi sirius, i'm one Mark Wes'.  I was reading the forum rules u posted.  What is NSFW content?  "], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "repentantlucifer", "subject": "Re: Forum moderation policy", "message_number": "#375"},
{"post": ["Hlw,Bitcoiners ", "I do not quite understand the question being asked here. Can you expand a bit upon this?", "I knew this was going to come up soon. ", "It looks as though whoever originally wrote these questions may not have used English as a first language, sorry about that. I would like to see the wording changed but im not sure its possible now. ", "I think what this one is basically getting at is, does theymos use trolls and moderation to distract people from the big issues facing bitcoin?", "I may be wrong but thats what i took it to mean.  ", "I may have posted the link but sorry i didn't write the messages. "], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "Taban", "subject": "Re: Forum moderation policy", "message_number": "#376"},
{"post": ["I suggest you to start with yourself. Why do you have a signature? Take it off and then suggest such action."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "saflem", "subject": "Re: Forum moderation policy", "message_number": "#377"},
{"post": ["I hope the forums are moderated a bit more carefully from now onwards. Spammers and those promoting some kind of ads should be banned absolutely."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "NanaLelyakova", "subject": "Re: Forum moderation policy", "message_number": "#378"},
{"post": ["Haven't seen any ads here at all, so it's safe to say that moderators are maintaining a good job."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "Daniel_West", "subject": "Re: Forum moderation policy", "message_number": "#379"},
{"post": ["Controls are good. Please add this to conditions for newbies like me to read as a matter of compulsion."], "page_number": 20, "url": "https://bitcointalk.org/index.php?topic=20333.360", "author": "MainIbem", "subject": "Re: Forum moderation policy", "message_number": "#380"},
{"post": ["What do you mean by \"advertise campaigns\"? Are they part of a signature campaign? If so, that's on the campaign manager to allow or prohibit multiple users participating within the campaign on the same IP."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "mprep", "subject": "Re: Forum moderation policy", "message_number": "#401"},
{"post": ["1558678231"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1558678231"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "1558678231", "subject": "1558678231", "message_number": "#2"},
{"post": ["1 IP per user."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "Actor_Tom_Truong_", "subject": "Re: Forum moderation policy", "message_number": "#402"},
{"post": ["Can somebody assist me in one questions.", "I tried to make ANN post, however when did it last  several lines were not posted.", "Is it limit in this forum of text lines? Or I am doing something wrong?"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "Cacaparg", "subject": "Re: Forum moderation policy", "message_number": "#403"},
{"post": ["From ", ":", "Also, from ", ": "], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "mprep", "subject": "Re: Forum moderation policy", "message_number": "#404"},
{"post": ["Is there any feasible way to un-ban a profile?"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "Therly", "subject": "Re: Forum moderation policy", "message_number": "#405"},
{"post": ["To avoid banning  your profile you need to read first the basics forum rules here on bitcoin world.Definitely there's a process before you totally banned.As What I've remembered first to fourth offense and these are the followings:", "First Offense: 7 days suspension", "Second Offense: 14 days suspension", "Third Offense: 30 days suspension", "Fourth Offense: Permanent banned"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "nethan1btc", "subject": "Re: Forum moderation policy", "message_number": "#406"},
{"post": ["How about how to upload a video in this forum???"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "fanou1989", "subject": "Re: Forum moderation policy", "message_number": "#407"},
{"post": ["You can't. Best you can do is link to a video on an external site (e.g. Youtube)."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "mprep", "subject": "Re: Forum moderation policy", "message_number": "#408"},
{"post": ["There are so many topics that ask for personal experiences and not so much for the real helpful discussions. Hope there are ways that the community will provide filters to help lessen the light topic threads."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "FDC1412", "subject": "Re: Forum moderation policy", "message_number": "#409"},
{"post": ["Forum moderation policy very important, because you can't bad comment with your related. this forum is fair side, so do you post positive. "], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "mdripon", "subject": "Re: Forum moderation policy", "message_number": "#410"},
{"post": ["The previous rule was almost unlimited free speech. Everything has been put in the FAQ but we have grown to love them.", " The forum moderator can have arbitrary control, it can not have a meaningful discussion or trust forum threads to actually represent the opinion of the user by Any way if they abuse this", "Freedom of speech has a lower priority, so the moderator will ignore it when it's working with the main goal."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "DRogers", "subject": "Re: Forum moderation policy", "message_number": "#411"},
{"post": ["Bitcoin forum moderation policy is being abused to censor valid options for bitcoin BTC users to consider.", "A proposed new litmus test for \"is it an altcoin?\" to be applied within existing moderation policies:", "    If the proposed change is submitted, and accepted by supermajority of mining hashpower, do bitcoin users' existing keys continue to work with existing UTXOs (bitcoins)?", "It is clearly the case that if and only if an economic majority chooses a hard fork, then that post-hard-fork coin is BTC.", "Logically, bitcoin-XT, Bitcoin Unlimited, Bitcoin Classic, and the years-old, absurd 50BTC-forever fork all fit this test. litecoin does not fit this test.", "The future of BTC depends on firmly in the hands of user choice and user freedom. Criticizing what-BTC-might-become posts are antithetical to the entire bitcoin ethos."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "cryptopass", "subject": "Re: Forum moderation policy", "message_number": "#412"},
{"post": ["Is there a thread to describe how your action goes up on right here?"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "Hishand", "subject": "Re: Forum moderation policy", "message_number": "#413"},
{"post": ["What do you understand about this topic. No sense, but still allowed"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "duybuom2010", "subject": "Re: Forum moderation policy", "message_number": "#414"},
{"post": ["Dear   MOD,", " It is requested that i want to know how to add your own made digital currency on market for trading. as i made a digital currency and i want to add it to market for  trading.", "Regards,", "araishkhan."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "araishkhan", "subject": "Re: Forum moderation policy", "message_number": "#415"},
{"post": ["forum policies should be further improved especially:", "1. in the field of assessment of the results of posts whether to provide benefits or not", "2. not selling anything in the group", "3. do not share something like reff code", "4. speaks politely and does not use harsh sentences", "5. payment can be determined by the quality of the posting quality provided"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "ihsanskanzaone", "subject": "Re: Forum moderation policy", "message_number": "#416"},
{"post": ["Is there any feasible way to un-ban a profile?"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "Strught85", "subject": "Re: Forum moderation policy", "message_number": "#417"},
{"post": ["Depends what it was banned for. Is it locked as a security measure or banned for some other reason? It usually states so unless it's a permaban, but I'd suggest making a thread in Meta about it. "], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#418"},
{"post": ["probably because of the effort and a bit of sense, The most important thing to try and think does not make sense. try seriously it will have the teloransi to be accepted, the business from the same the same because it will produce results although less than the maximum"], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "Cacingkemi", "subject": "Re: Forum moderation policy", "message_number": "#419"},
{"post": ["I will try to follow your instructions word by word."], "page_number": 21, "url": "https://bitcointalk.org/index.php?topic=20333.400", "author": "jakirtanvir", "subject": "Re: Forum moderation policy", "message_number": "#420"},
{"post": ["I very well could have, but since I just joined the forum...I wanted to make my first post. Had to do it sometime so why not ask a stupid question. It seems others do it. Also, others ask nonstupid questions that a google search will provide answers for."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Breakfastchief", "subject": "Re: Forum moderation policy", "message_number": "#341"},
{"post": ["1558678232"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["It's better if a member who started the topic locks it rather than a moderator. This will avoid restrictive moderation policy and will ensure free speech at all time. a moderator can then encourage such voluntary locking as and when required"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "aaf-18", "subject": "Re: Forum moderation policy", "message_number": "#342"},
{"post": ["I recently heard that if your company make fault or weekly maximum for comments, for example in my campaign it is 35 comments max per week, it's better to not stay exactly 35 to make as much money as it possible, if you hit the maximum you gonna have negative trust, so better to stay like 30 or even less to not be banned."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Taki", "subject": "Re: Forum moderation policy", "message_number": "#343"},
{"post": ["Intervening when people are generally being unloving to each other is always a good moderation policy. Violent and angry communication will never lead to a clear assessment of any topic so why encourage it to begin with.   +1"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "X7", "subject": "Re: Forum moderation policy", "message_number": "#344"},
{"post": ["Me to. We don't need NSFW content in this forum. Whithout that content this forum chat is still running. And its more safe for kids. "], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "agamasrori", "subject": "Re: Forum moderation policy", "message_number": "#345"},
{"post": ["It's not a bad idea to remove junk and spam messages. But I would like to know about how post quality is determined and I would be glad to hear about all the factors that makes our post spam. "], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "marleybobthedog", "subject": "Re: Forum moderation policy", "message_number": "#346"},
{"post": ["I too want to know the same. Many user are saying about many factors that makes our post spam. Although my messages weren't deleted every bit i am rather afraid of sick policy. I would be happy if you provide the link or say me about full policy."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "coynedterm", "subject": "Re: Forum moderation policy", "message_number": "#347"},
{"post": ["There is no fixed answer to that question. There is no exact \"policy\", nor can there be a policy that is good enough for determining spam/low quality posts. Easy examples of posts that get answered are posts that contain only emoticons, a good amount of posts that contain only 1 word (e.g. \"watching\"), posts that contain only insults (without any other input), etc. This is definitely not a \"sick policy\". This is a privately owned forum, and as such can enact any set of rules that the owners decide on. You can read the full (unofficial) ", ". "], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Lauda", "subject": "Re: Forum moderation policy", "message_number": "#348"},
{"post": ["As far as i understand , spam post are those post  that are not   on topic and  doesnt even  relevant  into it and  also  its doesnt  contribute anything to the community thats how  i  understand  on a spam post thats why  its one of the  most  important rule  in this  forum on not to commit spams."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Oilacris", "subject": "Re: Forum moderation policy", "message_number": "#349"},
{"post": ["where I can learn the rules of this forum?"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "gopal11", "subject": "Re: Forum moderation policy", "message_number": "#350"},
{"post": ["Read this thread: ", "."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Lauda", "subject": "Re: Forum moderation policy", "message_number": "#351"},
{"post": ["Correct. And your post is spam, clearly. ", "But then you know that. You are an expert in this field.", "Any reason you post spam? Well writing multiple posts per day on multiple farmed accounts is time consuming i guess.", "Your account is part of the 400ish farmed accounts i have listed here, ", "You are on an alphabetical list i see. You are \"O\".", "(i haven't listed you yet, but check later, it will be there. i love alphabet lists, so easy to spot)"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "rizzlarolla", "subject": "Re: Forum moderation policy", "message_number": "#352"},
{"post": ["That's correct, it is a zero value post."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "-ck", "subject": "Re: Forum moderation policy", "message_number": "#353"},
{"post": ["Re: avoiding bans for shit posting, imagine you are in a real life group conversation before you post. ", "Would you repeat immediately what the two people before you just said? Would you speak without forming a proper coherent sentence? Or would you keep your mouth shut until you felt you had something solid/interesting to contribute?", "It's not rocket science."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "tmfp", "subject": "Re: Forum moderation policy", "message_number": "#354"},
{"post": ["Guidelines are normal. These guidelines are very easy to follow.... and yes thank you for giving freedom to post here on BTC. Those who love BTC will never ever post anything vulgar/uninteresting post. "], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Jessica136", "subject": "Re: Forum moderation policy", "message_number": "#355"},
{"post": ["How many minutes, or messages I need to send or spend here in order to increasy my level from newbie to member? is there a list or reference for this at some place here?"], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "USBitcoinServices.Com", "subject": "Re: Forum moderation policy", "message_number": "#356"},
{"post": ["No messages, its about posts and time. Everything over one post in time will not increase your activity and thus not your rank.", "-> "], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "shorena", "subject": "Re: Forum moderation policy", "message_number": "#357"},
{"post": ["are post allowed here like for marketing but in a descriptive manner not really sounds like selling or in short are we allowed to post company brand here."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "seojohng", "subject": "Re: Forum moderation policy", "message_number": "#358"},
{"post": ["If it's a new service that you're trying to *advertise* you could open a thread in ", ". If you want to discuss an existing service then use ", ". Just make sure that you do not post in other threads and constantly include the link to such a service as that would likely be considered advertising spam."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "Lauda", "subject": "Re: Forum moderation policy", "message_number": "#359"},
{"post": ["I have never understood why people are sending spam in such forums is a little what will, and will do more harm than good."], "page_number": 22, "url": "https://bitcointalk.org/index.php?topic=20333.340", "author": "staff_1307", "subject": "Re: Forum moderation policy", "message_number": "#360"},
{"post": ["I'm still a newbie (joined in 2014!!!!!!!!!!) (STILL A NEWBIE?", "??) because I don't post junk, about anything and everything. It means I'm not eligible for most bounties, and don't always get taken seriously by forum members. Shame, as I have been in the space since 2012. Just tickles me that I'm still classed as newbie!!!!"], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "Ashdad", "subject": "Re: Forum moderation policy", "message_number": "#461"},
{"post": ["No, these aren't allowed either.", "Who says you have to post junk? All you would have needed was to make 30 posts over 3 activity periods and you would be a Junior Member. Activity reflects how ", " you have been, not merely how long you have been registered here. If that was the case, anyone could just buy an old hacked account and suddenly claim to be a long-time member without any posts or contributions, but that's why the activity system is there in the first place and is actually a fairly good system (though of course people can game or abuse it). "], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#462"},
{"post": ["Totally understandable, I just can't imagine the workload and the spam of same threads that you get from us guys. I am quite new here, but when I need something I first search for it, before posting a new thread. ", "Keep up the good work! "], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "krun4", "subject": "Re: Forum moderation policy", "message_number": "#463"},
{"post": [" ", "I agree. I was just thinking it would have been handy for that time I gave away coins to newbies about a week ago and had to make sure people weren't suddenly signing up multiple times to the forum just to get in on the giveaway. I had to click through to each member's profile page to check."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "Devmahi", "subject": "Re: Forum moderation policy", "message_number": "#464"},
{"post": ["yep i totally agree with this one. this forum should strive to earn for the betterment of each and every member of this group. I really think that we need to help each other out in order to create a better understanding of bitcoins and the importance of cryptocurrency in the world."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "xavfire13", "subject": "Re: Forum moderation policy", "message_number": "#465"},
{"post": ["Yes, very strange ", " if I do not want to write a long post, but just express my consent or say thank you for something?"], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "iiiiinspiration", "subject": "Re: Forum moderation policy", "message_number": "#466"},
{"post": ["I don't understand no 5, ", "NSFW content. What's NSFW??"], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "_backslash", "subject": "Re: Forum moderation policy", "message_number": "#467"},
{"post": ["It means not safe for work, mostly that you can see words NSFW when there are porn contents or the same thing as that. To know the whole thing about NSFW, you can read all details here ", " it will tell you about almost everything about it.", "Just make sure it's not an off topic one, there are questions that are answerable by a simple yes or no and if you want to express gratitude by saying thank you that's fine as long as it's not off topic."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "batang_bitcoin", "subject": "Re: Forum moderation policy", "message_number": "#468"},
{"post": ["not safe for work like any nudity or violence.  kind of vague, wish they can elaborate on it so there's no misunderstanding.  forums definition across the web are subjective to what is nsfw and what is not nsfw.  but to be safe, don't post anything you wouldn't want your kid should not read or see.  "], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "cbob1911", "subject": "Re: Forum moderation policy", "message_number": "#469"},
{"post": ["controlling topics of quality discussion is a good thing, anything that is not desirable in the post should be removed in order to reduce the accumulation of a discussion that does not get a response from members of the btc forum. so the window of discussion is not so dense with the title of discussion that is not desirable."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "Yukyzu", "subject": "Re: Forum moderation policy", "message_number": "#470"},
{"post": ["I have reported several topics that have been deleted.  This is not an issue of free speech.  This is an issue about speaking the language of the forum at hand well enough to make a point that is of legitimate substance.  Too many on this forum cannot do this even with Google translate helping them.  In other words if you post nonsense moderators will delete it or other members will report it to be deleted via the discretion of moderators.", "Example...even though your sentence technically properly formed in English, it is nonsense.  It registers in the mind as if I was to type asdfjk;/ asdfjkl'; asdfjk; asdfjk;l;/ asdfjkl;.  Most that know how to type can figure out where I get the pattern too.  Just because they can understand it doesn't make it any less irrelevant to any given topic unless someone is asking for typing patterns.", "I don't think the moderators want a forum here called \"Look at me!  I can write in (barely) comprehensible complete English sentences!!\"", "But that is all most of so many people on this forum are doing.  Nonsense aka shitposts are pushing users of this forum to crack down on it once it really spirals out of control.  I live in a country where people who barely speak English ask me about doing BTC campaigns.  I tell them \"NO!\" since I know where they will end up spewing nonsense.  Enough is enough."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "Realist247", "subject": "Re: Forum moderation policy", "message_number": "#471"},
{"post": ["I heard something wrong is going on with the current threads being escalated here and there.", "Is this thing stiill going to continue or we should wait for its clean-action?"], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "bountyportals", "subject": "Re: Forum moderation policy", "message_number": "#472"},
{"post": ["Almost all of my comments are being deleted by a random Mod I don't know why.", "My comments are just like ", "Thank you for the airdrop!", "I will support the token , success.", "Something like that, why is that being delete?"], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "AntonioE", "subject": "Re: Forum moderation policy", "message_number": "#473"},
{"post": ["Why don't you read the rules and the sticky in the bounty section? They're being deleted for being utterly pointless spam:", "Those sorts of posts serve no purpose at all other than people trying to rank up their accounts."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#474"},
{"post": ["Well some Token require to have forum post of each member who wants to join a specific token. If they delete it nobody will meet the requirements."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "AntonioE", "subject": "Re: Forum moderation policy", "message_number": "#475"},
{"post": ["Then those threads are breaking the rules and if spotted or reported will be trashcanned."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#476"},
{"post": ["Okay in that case they should regulate it and stop them from requiring members to post in the forum so that everyone is free to join"], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "AntonioE", "subject": "Re: Forum moderation policy", "message_number": "#477"},
{"post": ["An easier solution is that you take English classes or find an English speaker and spend as much time with them as humanly possibly so your \"sense\" isn't complete nonsense and also has SUBSTANCE."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "Realist247", "subject": "Re: Forum moderation policy", "message_number": "#478"},
{"post": ["how do we outline spamming or flaming..."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "fedorkr6", "subject": "Re: Forum moderation policy", "message_number": "#479"},
{"post": ["Referral spam, yes. No need to have to make however yet another subject about a service just to encourage your referral link."], "page_number": 23, "url": "https://bitcointalk.org/index.php?topic=20333.460", "author": "fedora8", "subject": "Re: Forum moderation policy", "message_number": "#480"},
{"post": ["IKR? I am running a personal forum and DAMN these spam guys have way too much time to flood it with irrelevant stuff. Seem like I need to implement the same policy as you guys. You guys are doing a great job Btw. Keep it up."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "btcwonder1", "subject": "Re: Forum moderation policy", "message_number": "#381"},
{"post": ["1558678232"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["1558678232"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "1558678232", "subject": "1558678232", "message_number": "#2"},
{"post": ["Its hard to move on if you not knowing what happening about spam. now is the time to make changes to the beginner of this bitcoin rules we need to reading searching wisely."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "Jerzzz", "subject": "Re: Forum moderation policy", "message_number": "#382"},
{"post": ["Free of speech as long as the thing that we are say still in the topic,", "Am i wrong???"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "aliffuture44", "subject": "Re: Forum moderation policy", "message_number": "#383"},
{"post": ["No, this is a private forum not some country's ideals. There is no guarantee of freedom of speech. Stick to the rules only."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "-ck", "subject": "Re: Forum moderation policy", "message_number": "#384"},
{"post": ["Moderation Policy is a bit too contrasting in terms of details. I think it is opinion based, and free talk in this environment, but for now no useless, and etc. I think they should reconstruct this one. "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "bs.glory", "subject": "Re: Forum moderation policy", "message_number": "#385"},
{"post": ["mode rators delete threads that are conflict with their own interest thereby reducing the quantity and quality of information users can discover. but this message board is by the original btc guys so they will struggle with the powershift in btc that occurs as they cashout and new owners take over"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "Midas111", "subject": "Re: Forum moderation policy", "message_number": "#386"},
{"post": ["Do you actually have any evidence of that because if you did they would likely be removed from staff. I'm guessing you probably either didn't read or can't follow the rules though which is why your posts or threads will have been removed. "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#387"},
{"post": ["I made a perfectly reasonable post that is in line with actual data, and it was deleted. No transparency as to who deleted it, no way to appeal it, or determine why it was deleted. How exactly does the moderation work, and why isn't there a better system for oversight/communication when things are deleted? I assume such protocols are in place, but I'm relatively new here."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "StevenRA", "subject": "Re: Forum moderation policy", "message_number": "#388"},
{"post": ["You can create a thread about it in Meta if you really wish but read the rules first as it was almost certainly removed for breaking one: ", "Posts are removed for a whole host of reasons but staff don't have the time to explain or argue every single one so bear that in mind. "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#389"},
{"post": ["Thanks. Nah, not worth it (and the thread itself would risk getting deleted I guess). Looking at the rules the only one it could possibly be would be #1, which seem quite subjective. I get deleting obvious spam, but beyond that, subjective guidelines enforced in a non-transparent fashion is not a great mechanism. With wikis there's usually some means of seeing the moderation. But clearly I'm new here, so if those are the rules of the game, I'll follow along."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "StevenRA", "subject": "Re: Forum moderation policy", "message_number": "#390"},
{"post": ["Your thread won't be deleted. Most rules or laws are subjective and is down to the person who is enforcing them but there was likely a good reason for it being deleted. It could have been a valid response in your eyes, but if the answer had already been given sufficiently or it was in a necrobumped thread then it may/can be removed. "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#391"},
{"post": ["In something anywhere and anytime (navigation link, very sticky or other) that explains the moderation guidelines and spammers?"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "rido", "subject": "Re: Forum moderation policy", "message_number": "#392"},
{"post": ["There are signature guidelines here: ", "And forum rules here:"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#393"},
{"post": ["No problem. Truth is, I like staying in this forum. I rather stay here than reading bitcoin news in Google. Every one has something good to say. Every one has their opinion to be respected. "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "Aur3", "subject": "Re: Forum moderation policy", "message_number": "#394"},
{"post": ["New here.  Is there a policy for quoting news articles or other sources for reference in a post you are making?  Like cutting and pasting a small section of text and citing the source with a link?"], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "HashFace", "subject": "Re: Forum moderation policy", "message_number": "#395"},
{"post": ["I am agree this implimentation but not for all what mentioned. I think it should be,", "1.Unnecessary speach,", "2.non information speach , ", "3.non similar talks", "4.point less talks. is  inof."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "bvg96634", "subject": "Re: Forum moderation policy", "message_number": "#396"},
{"post": ["I agree. I' a newbie here but I believe that having guidelines would make forums like this so much healthier and enjoyable for many. Without policies, we're like driving in the streets without traffic rules. Sure sounds like a huge traffic jam."], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "fishbonez11", "subject": "Re: Forum moderation policy", "message_number": "#397"},
{"post": ["    i feel misdirected to join this forum by an add and then i ask a question about where to post a comment like i was instructed to do by the add , and registering etc , promising i could mine ethereum , and then my simple and clear question gets DELETED , guyes .. really... UNSUSCRIBE me here immediately , what a waste of time to trust this and get treated like this while following instructions, crazy .. forget it. i would like to UNSUSCRIBE , or please tell me how to do that at once here , cuz i have tried now multiple times but can not find where to do that, getting a very scammy feeling.  i find this really very uncool. Shashine , u have my email moderator i assume, which is bad enough. - "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "Shashine", "subject": "Re: Forum moderation policy", "message_number": "#398"},
{"post": ["Thank you for this, as a new here. It will prevent new member to spam replies. "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "b_parin", "subject": "Re: Forum moderation policy", "message_number": "#399"},
{"post": ["Today a friend of mine asked me something that made me thoughtful, he is a member of the forum and he has a brother who is also a member. He wanted to know if it's a problem using the same IP to advertise the campaigns. I replied that this is dangerous as it may appear that it is duplicating accounts. But how can they advertise campaigns with the same IP? Or is it not allowed?  "], "page_number": 24, "url": "https://bitcointalk.org/index.php?topic=20333.380", "author": "josucoin", "subject": "Re: Forum moderation policy", "message_number": "#400"},
{"post": ["No more than once daily. You shouldn't bump a post too many times in a row. Bumping shouldn't be annoying. Delete old \"bump\" posts so they don't clutter up the topic."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "theymos", "subject": "Re: Forum moderation policy", "message_number": "#101"},
{"post": ["1558678233"], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "1558678233", "subject": "1558678233", "message_number": "#2"},
{"post": ["1558678233"], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "1558678233", "subject": "1558678233", "message_number": "#2"},
{"post": ["Interesting policy. I consider pure bump posts very very rude. If I can't make up any \"\"\"news\"\"\", I don't bump my threads.", "If bumping is all fine with the mods, could you please introduce a checkbox \"bump up once per day\" so I can bump it without cluttering it with \"/bump\" posts? Aka I don't agree with pure bumping being all fine as it is the opposite of the often requested feature of rating posts and threads."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "giszmo", "subject": "Re: Forum moderation policy", "message_number": "#102"},
{"post": ["I like Alex A+. There needs to be a place for people to say what ever they want. Then there needs to be a place that is women and young person friendly. The newbie forum would be a excellent place for full rule enforcement the trading forum not so much. If you can let the people know clearly what kind of room their in they will generally self regulate the content. If we develop and area for \"serious\" transactions that is clearly marked with expected behavior clearly posted then you wont have to spend so much time micromanaging.  "], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "sublime5447", "subject": "Re: Forum moderation policy", "message_number": "#103"},
{"post": ["All sections have moderators.....but there is no moderator for INDIA..Please nominate a moderator"], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "luckyindia", "subject": "Re: Forum moderation policy", "message_number": "#104"},
{"post": ["Its been pretty lax so far "], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "Mike Christ", "subject": "Re: Forum moderation policy", "message_number": "#105"},
{"post": ["Completely agree. I think the moderator is on a power trip and definitely giving more favor to larger companies. I asked the moderator  in the general discussion to please clarify why some service announcements are allowed (eg. Dentist accepting Bitcoin, Bitpay announcements, etc.) and others are moved to the services announcement page.", "My request to clarify post was promptly moved to the \"other/meta\" thread. lol. I think there's a kickback system going on here. I will be starting a reddit post to try to give this more attention. New services are being shutout at the discretion of the moderator.   "], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "betafall", "subject": "Re: Forum moderation policy", "message_number": "#106"},
{"post": ["Limited Liberty is ok. Too much of Liberty is dangerous as it may affect the interests of other members. Anything may be stated as long as the interests of a majority of members are not affected."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "luckyindia", "subject": "Re: Forum moderation policy", "message_number": "#107"},
{"post": ["After 9 years regular army and a lifetime as an interstate truck driver, I believe I've heard it all, but expletive suffused posts still drive me spare, so I excersise my own form of moderation, if you can't express yourself in a Proper manner than I will simply ignore your post, no matter how relevant, informative or interesting it may be.", "I've been part of ( and still am) many forums where offensive language is simply not tolerated, likewise with personal attacks involving race, creed, colour or religion, sexual proclivities or otherwise, yet the debate still remains robust.", "Free speech by all means, but with free speech comes responsibility too and a limitless courtesy and respect go a long way."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "NedKLee", "subject": "Re: Forum moderation policy", "message_number": "#108"},
{"post": ["oh i guess my avatar isn't safe for work probably...."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "claire", "subject": "Re: Forum moderation policy", "message_number": "#109"},
{"post": ["I think it's kinda borderline.  We'll see if we get any complaints first."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "MoonShadow", "subject": "Re: Forum moderation policy", "message_number": "#110"},
{"post": ["I'd suggest changing it, I wouldn't want that showing up on my computer at work."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "tysat", "subject": "Re: Forum moderation policy", "message_number": "#111"},
{"post": ["If you work at the FED, yeah, it is NSFW "], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "giszmo", "subject": "Re: Forum moderation policy", "message_number": "#112"},
{"post": ["Like when the mods imposed their own ideologies in the sidebar of r/bitcoin? And refused to remove it even though a clear majority wants to get rid of them?", "Yeah, I hate that too."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "Alpaca John", "subject": "Re: Forum moderation policy", "message_number": "#113"},
{"post": ["I find the trust system and its future implementation quite intrusive."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "bernard75", "subject": "Re: Forum moderation policy", "message_number": "#114"},
{"post": ["I would like to also suggest:", "This would help stop threads degenerating into mud slinging matches and abuse.  There are a number of recent threads where physical threats have been made which I don't think helps to build a cohesive community.", "I am sure other people may think differently and like the entertainment factor.  Just my 2 satoshis."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "jimmijames73", "subject": "Re: Forum moderation policy", "message_number": "#115"},
{"post": ["Banning people for insults etc. is a one way trip to making the forum deserted, considering how vague rules usually are it means you could get banned for calling a moderator out for being a power tripping douchebag, I can't believe how many people are missing the ignore function, it's perfectly easy to use and great at blocking people from annoying you when you're having a discussion."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "Lethn", "subject": "Re: Forum moderation policy", "message_number": "#116"},
{"post": ["Is there a thing anywhere (navigation link, sticky or otherwise) which explains the moderation and/or spammer guidelines?"], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "faiza1990", "subject": "Re: Forum moderation policy", "message_number": "#117"},
{"post": ["Are moderators really reading through every post to determine if its valuable or not?  How do we call attention to posts that really suck?  Can we ban people of low intelligence?  Is it right to do so?"], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "TitanBTC", "subject": "Re: Forum moderation policy", "message_number": "#118"},
{"post": ["Not anymore.", "The report button.", "We could, but no, that wouldn't be proper."], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "MoonShadow", "subject": "Re: Forum moderation policy", "message_number": "#119"},
{"post": ["Love is not only for beautiful people, and Bitcoins are not only for intelligent, wealthy people. "], "page_number": 25, "url": "https://bitcointalk.org/index.php?topic=20333.100", "author": "TippingPoint", "subject": "Re: Forum moderation policy", "message_number": "#120"},
{"post": ["In school, almost every question that requires critical thinking and proof of knowledge of the topic requires an explanation.", "I'll give you an example of where your post/reply would be graded as a \"failure\" by the average teacher in the world:", "\"Doe an ICO project require effort spent in public relations?  Why or why not?\"", "Your statement doesn't give any reason or substance with respect to your point of view.  So, based on the spirit of raising standards here on this forum, you do need to write complete thoughts to explain what is obvious to possibly only you....to those that are not mind readers which is pretty much everyone as far as anyone knows."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "Realist247", "subject": "Re: Forum moderation policy", "message_number": "#501"},
{"post": ["1558678234"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "1558678234", "subject": "1558678234", "message_number": "#2"},
{"post": ["1558678234"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "1558678234", "subject": "1558678234", "message_number": "#2"},
{"post": ["1558678234"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "1558678234", "subject": "1558678234", "message_number": "#2"},
{"post": ["1558678234"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "1558678234", "subject": "1558678234", "message_number": "#2"},
{"post": ["1558678234"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "1558678234", "subject": "1558678234", "message_number": "#2"},
{"post": ["1558678234"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "1558678234", "subject": "1558678234", "message_number": "#2"},
{"post": ["does this depend on the context of Wink? is it possible we can get high value posts"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "CETPENCET23", "subject": "Re: Forum moderation policy", "message_number": "#502"},
{"post": ["[/quote]", "In school, almost every question that requires critical thinking and proof of knowledge of the topic requires an explanation.", "I'll give you an example of where your post/reply would be graded as a \"failure\" by the average teacher in the world:", "\"Doe an ICO project require effort spent in public relations?  Why or why not?\"", "Your statement doesn't give any reason or substance with respect to your point of view.  So, based on the spirit of raising standards here on this forum, you do need to write complete thoughts to explain what is obvious to possibly only you....to those that are not mind readers which is pretty much everyone as far as anyone knows.", "[/quote]", "1- we are not in or at school", "2- i dont think you are qualifyed as a teacher either", "3 - when we are in a group fighting for decentralisation this kind of MOD  \" i delete all what i  dont like\" or \" dont have enaught explanations to support the comment\"   make me laught.", "any retard would understand that without public relation an ico is a failure, obviously the MOD need a picture in 3 dimentions"], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "Yamoto", "subject": "Re: Forum moderation policy", "message_number": "#503"},
{"post": ["1) Your reply that \"we are not in or at school\" shows that you, yourself, do not understand even complex explanations or analogies, further strengthening the argument for why the mods must be strict to eliminate incomplete statements or utter nonsense.", "2)  I don't care what you think about my abilities to teach.  I was giving an example as to what is considered acceptable vs. unacceptable in the English speaking portion of the world and what is considered of high standards...standards that the moderators are trying to enforce to lend credibility to this forum that is otherwise becoming unreadable because of shitposters.", "3) Who fights for this?  People whose English sucks?  If you cannot write in English at a reasonable level, stick to your native language forum.  This is a no-contest no-brainer.", "Be careful when talking about retards....most people posting on these forums probably have an IQ near that level....so in this case it's the MODS protecting the majority of the readers that do not post."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "Realist247", "subject": "Re: Forum moderation policy", "message_number": "#504"},
{"post": ["I have small problem.", "As a newbie I have many problem regarding cryptocurrency.If I mention my all problem will the administrators think they are useless and ban me.??", "Is there any limitation to update post Per week ?", "Please someone explain me.It is a great help."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "kim93", "subject": "Re: Forum moderation policy", "message_number": "#505"},
{"post": ["Ask your questions in your native language forum if your English is not at a solid conversation level.  English is my 2nd language but I've spent most of my life practicing it.  That said, I don't blame the moderators one bit for banning what comes across as nonsense.  Ironically I can read between the lines of the nonsensical English that I come across but it gives me a splitting headache...and this is where so many have been complaining for the mods to take action.  You might be able to read English perfectly well but if you are posting while translating in your head that's where everything goes wrong.  Just post in your native forum and be patient.  An answer will come if you are persistent."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "Realist247", "subject": "Re: Forum moderation policy", "message_number": "#506"},
{"post": ["is there any reason to not just fully ban referral codes? They're mostly just spam and don't really benefit the forum any. ", " ", " "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "sehanmaxx01", "subject": "Re: Forum moderation policy", "message_number": "#507"},
{"post": ["Bitcoin mining will be better after merger of AI and crypto-currency. It is a great news."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "leepfrog", "subject": "Re: Forum moderation policy", "message_number": "#508"},
{"post": ["I would also like this implemented ."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "omaraha", "subject": "Re: Forum moderation policy", "message_number": "#509"},
{"post": ["why would i post a relevant post and it gets deleted without warning "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "pingzdrake", "subject": "Re: Forum moderation policy", "message_number": "#510"},
{"post": ["Probably because it wasn't relevant or you didn't read the rules. Posts like this aren't allowed:", "The rest of your posts are also terrible. You'll be banned pretty soon if you don't drastically improve your content and contributions here. "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "hilariousandco", "subject": "Re: Forum moderation policy", "message_number": "#511"},
{"post": ["Good day. I noticed that there is a new incentive to delete the \"joined\" type posts (concerning the airdrops), and I am all for it. My question is if it is OK to post \"received the airdrop\" type posts.", "On one side that is not a very valuable post, but on the other side it is polite to thank the dev and to show to the others that the airdrop is legit (especially these days....)."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "Tahu-Gejrot", "subject": "Re: Forum moderation policy", "message_number": "#512"},
{"post": ["I think there done something mistake or rules also.", "And then it showed as terrible ."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "shahead720", "subject": "Re: Forum moderation policy", "message_number": "#513"},
{"post": ["However, the policy is being abused to censor valid options for bitcoin BTC users to consider."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "ZF_Razzaque", "subject": "Re: Forum moderation policy", "message_number": "#514"},
{"post": ["Would banning you be an abuse? You know, seeing as you just plagiarised a post from earlier in the thread:", "Oh, and these guys:", "Oh, and also this guy as well:", " ", " ", " "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#515"},
{"post": ["I think it would be nice that this will be implemented but how can the moderators monitor all of the junk ones?", "Well, good luck and hope this will be successful."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "cue", "subject": "Re: Forum moderation policy", "message_number": "#516"},
{"post": ["the guidelines on this honourable platform are well explained; however i will plead with moderators to temper justice with mercy especially on posts from members who have not stayed too long on the platform. Gradually with time, they would be well abreast with all guidelines and hence sanity would be achieved. "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "nick_nick", "subject": "Re: Forum moderation policy", "message_number": "#517"},
{"post": ["Yes, you are free to say anything but it has been clarified that only if it is RELEVANT to the topic. Saying harsh or rude words cannot be presented in a calm or polite manners because that is how powerful language is. Rude words will be recognized and interpreted as rude words."], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "Potchi", "subject": "Re: Forum moderation policy", "message_number": "#518"},
{"post": ["If you want to promote a site then Gambling. If you want to talk about it then probably Gambling Discussion.", "You can donate to the forum here: ", "Or buy a 'Copper' membership rank from here: "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "hilariousetc", "subject": "Re: Forum moderation policy", "message_number": "#519"},
{"post": ["Awareness about bitcoin is increasing on the internet, and more bitcoiners are coming everyday. It's about to completely get out from the dark, so, a new policy should be introduced. Nevertheless. there are still some bitcoiners who don't know how to use it, and basically they stop using it eventually. So a new policy should be introduced about not using your account for some time. ", "\"if a account holder has not used his/her account for months, his/her account should get 'put on hold' or 'removed' and BTC users should remain limited.\"  "], "page_number": 26, "url": "https://bitcointalk.org/index.php?topic=20333.500", "author": "hassan.shakeel.rajpoot", "subject": "Re: Forum moderation policy", "message_number": "#520"}
]